exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP0</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1F00</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>INT_GROUP1</name>
        <description>COMP0 interrupt (group 1, IIDX 2)</description>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>COMP0_FSUB_0</name>
          <description>Subscriber Port 0</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0_FSUB_1</name>
          <description>Subscriber Port 1</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0_FPUB_1</name>
          <description>Publisher port 1</description>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimArrayIndex/>
          <name>COMP0_GPRCM[%s]</name>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>COMP0_PWREN</name>
            <description>Power enable</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the power</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable Power</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable Power</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COMP0_RSTCTL</name>
            <description>Reset Control</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>RESETSTKYCLR</name>
                <description>Clear the RESETSTKY bit in the STAT register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear reset sticky bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETASSERT</name>
                <description>Assert reset to the peripheral</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ASSERT</name>
                    <description>Assert reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COMP0_CLKCFG</name>
            <description>Peripheral Clock Configuration Register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>BLOCKASYNC</name>
                <description>Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>disable COMP to request SYSOSC</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>enable COMP to request SYSOSC</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COMP0_GPRCM_STAT</name>
            <description>Status Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>RESETSTKY</name>
                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORES</name>
                    <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>The peripheral was reset since the last bit clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>COMP0_CPU_INT[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>COMP0_CPU_INT_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <name>STATR</name>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No pending interrupt</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>COMPIFG</name>
                    <description>Comparator output interrupt</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>COMPINVIFG</name>
                    <description>Comparator output inverted interrupt</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OUTRDYIFG</name>
                    <description>Comparator output ready interrupt</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COMP0_CPU_INT_IMASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COMPIFG</name>
                <description>Masks COMPIFG</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt is masked out</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt will request an interrupt service routine and corresponding bit in MIS will be set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMPINVIFG</name>
                <description>Masks COMPINVIFG</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt is masked out</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt will request an interrupt service routine and corresponding bit in MIS will be set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OUTRDYIFG</name>
                <description>Masks OUTRDYIFG</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt is masked out</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt will request an interrupt service routine and corresponding bit in MIS will be set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COMP0_CPU_INT_RIS</name>
            <description>Raw interrupt status</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COMPIFG</name>
                <description>Raw interrupt status for comparator output interrupt flag. The IES bit defines the transition of the comparator output setting this bit.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt pending</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMPINVIFG</name>
                <description>Raw interrupt status for comparator output inverted interrupt flag. The IES bit defines the transition of the comparator output setting this bit.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt pending</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OUTRDYIFG</name>
                <description>Raw interrupt status for comparator output ready interrupt flag. This bit is set when the comparator output is valid.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt pending</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COMP0_CPU_INT_MIS</name>
            <description>Masked interrupt status</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COMPIFG</name>
                <description>Masked interrupt status for COMPIFG</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>COMPIFG does not request an interrupt service routine</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>COMPIFG requests an interrupt service routine</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMPINVIFG</name>
                <description>Masked interrupt status for COMPINVIFG</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>COMPINVIFG does not request an interrupt service routine</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>COMPINVIFG requests an interrupt service routine</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OUTRDYIFG</name>
                <description>Masked interrupt status for OUTRDYIFG</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>OUTRDYIFG does not request an interrupt service routine</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>OUTRDYIFG requests an interrupt service routine</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>COMP0_CPU_INT_ISET</name>
            <description>Interrupt set</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>COMPIFG</name>
                <description>Sets COMPIFG in RIS register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing a 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>RIS bit corresponding to COMPIFG is set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMPINVIFG</name>
                <description>Sets COMPINVIFG in RIS register</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing a 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>RIS bit corresponding to COMPINVIFG is set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OUTRDYIFG</name>
                <description>Sets OUTRDYIFG in RIS register</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing a 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>RIS bit corresponding to OUTRDYIFG is set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
