exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>COMP0_CTL0</name>
          <description>Control 0</description>
          <addressOffset>0x1100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IPSEL</name>
              <description>Channel input selected for the positive terminal of the comparator if IPEN is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_0</name>
                  <description>Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_1</name>
                  <description>Channel 1 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_2</name>
                  <description>Channel 2 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_3</name>
                  <description>Channel 3 selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_4</name>
                  <description>Channel 4 selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_5</name>
                  <description>Channel 5 selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_6</name>
                  <description>Channel 6 selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_7</name>
                  <description>Channel 7  selected</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPEN</name>
              <description>Channel input enable for the positive terminal of the comparator.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Selected analog input channel for positive terminal is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Selected analog input channel for positive terminal is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMEN</name>
              <description>Channel input enable for the negative terminal of the comparator.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Selected analog input channel for negative terminal is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Selected analog input channel for negative terminal is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMSEL</name>
              <description>Channel input selected for the negative terminal of the comparator if IMEN is set to 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH_0</name>
                  <description>Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_1</name>
                  <description>Channel 1 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_2</name>
                  <description>Channel 2 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_3</name>
                  <description>Channel 3 selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_4</name>
                  <description>Channel 4 selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_5</name>
                  <description>Channel 5 selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_6</name>
                  <description>Channel 6 selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH_7</name>
                  <description>Channel 7 selected</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0_CTL1</name>
          <description>Control 1</description>
          <addressOffset>0x1104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>This bit turns on the comparator. When the comparator is turned off it consumes no power.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Comparator is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Comparator is on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>This bit selects the comparator operating mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST</name>
                  <description>Comparator is in fast mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>Comparator is in ultra-low power mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCH</name>
              <description>This bit exchanges the comparator inputs and inverts the comparator output.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXC</name>
                  <description>Comparator inputs not exchanged and output not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXC</name>
                  <description>Comparator inputs exchanged and output inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHORT</name>
              <description>This bit shorts the positive and negative input terminals of the comparator.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SHT</name>
                  <description>Comparator positive and negative input terminals are not shorted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHT</name>
                  <description>Comparator positive and negative input terminals are shorted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IES</name>
              <description>This bit selected the interrupt edge for COMPIFG and COMPINVIFG.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge sets COMPIFG and falling edge sets COMPINVIFG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge sets COMPIFG and rising edge sets COMPINVIFG</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>These bits select the hysteresis setting of the comparator.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HYS</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_HYS</name>
                  <description>Low hysteresis, typical 10mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED_HYS</name>
                  <description>Medium hysteresis, typical 20mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH_HYS</name>
                  <description>High hysteresis, typical 30mV</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPOL</name>
              <description>This bit selects the comparator output polarity.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_INV</name>
                  <description>Comparator output is non-inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Comparator output is inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTEN</name>
              <description>This bit enables the analog filter at comparator output.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Comparator output filter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Comparator output filter is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTDLY</name>
              <description>These bits select the comparator output filter delay. See the device-specific data sheet for specific values on comparator propagation delay for different filter delay settings.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLY_0</name>
                  <description>Typical filter delay of 70 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_1</name>
                  <description>Typical filter delay of 500 ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_2</name>
                  <description>Typical filter delay of 1200 ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLY_3</name>
                  <description>Typical filter delay of 2700 ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINCOMPEN</name>
              <description>This bit enables window comparator operation of comparator.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>window comparator is disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>window comparator is enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
