exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>WWDT0_WWDTCTL0</name>
          <description>Window Watchdog Timer Control Register 0</description>
          <addressOffset>0x1100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000043</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PER</name>
              <description>Timer Period of the WWDT. These bits select the total watchdog timer count.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_25</name>
                  <description>Total timer count is 2^25</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_21</name>
                  <description>Total timer count is 2^21</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_18</name>
                  <description>Total timer count is 2^18</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_15</name>
                  <description>Total timer count is 2^15</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_12</name>
                  <description>Total timer count is 2^12 (default)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_10</name>
                  <description>Total timer count is 2^10</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_8</name>
                  <description>Total timer count is 2^8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_6</name>
                  <description>Total timer count is 2^6</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW0</name>
              <description>Closed window period in percentage of the timer interval. WWDTCTL1.WINSEL determines the active window setting (WWDTCTL0.WINDOW0 or WWDTCTL0.WINDOW1).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_0</name>
                  <description>0% (No closed Window)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_12</name>
                  <description>12.50% of the total timer period is closed window</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_18</name>
                  <description>18.75% of the total timer period is closed window</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_25</name>
                  <description>25% of the total timer period is closed window</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_50</name>
                  <description>50% of the total timer period is closed window</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_75</name>
                  <description>75% of the total timer period is closed window</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_81</name>
                  <description>81.25% of the total timer period is closed window</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_87</name>
                  <description>87.50% of the total timer period is closed window</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Window Watchdog Timer Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WINDOW</name>
                  <description>Window Watchdog Timer Mode. The WWDT will generate a error signal to the ESM when following conditions occur: - Timer Expiration (Timeout) - Reset WWDT during the active window closed period - Keyword violation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERVAL</name>
                  <description>Interval Timer Mode. The WWDT acts as an interval timer. It generates an interrupt on timeout.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STISM</name>
              <description>Stop In Sleep Mode.   
The functionality of this bit requires that POLICY.HWCEN = 0. If POLICY.HWCEN = 1 the WWDT resets during sleep and needs re-configuration.
Note: This bit has no effect for the global Window Watchdog as Sleep Mode is not supported.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <description>The WWDT continues to function in Sleep mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>The WWDT stops in Sleep mode and resumes where it was stopped after wakeup.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Module Clock Divider, Divide the clock source by CLKDIV+1.
Divider values from /1 to /8 are possible.
The clock divider is currently 4 bits. Bit 4 has no effect and should always be written with 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WINDOW1</name>
              <description>Closed window period in percentage of the timer interval. WWDTCTL1.WINSEL determines the active window setting (WWDTCTL0.WINDOW0 or WWDTCTL0.WINDOW1).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_0</name>
                  <description>0% (No closed Window)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_12</name>
                  <description>12.50% of the total timer period is closed window</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_18</name>
                  <description>18.75% of the total timer period is closed window</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_25</name>
                  <description>25% of the total timer period is closed window</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_50</name>
                  <description>50% of the total timer period is closed window</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_75</name>
                  <description>75% of the total timer period is closed window</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_81</name>
                  <description>81.25% of the total timer period is closed window</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_87</name>
                  <description>87.50% of the total timer period is closed window</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDT0_WWDTCTL1</name>
          <description>Window Watchdog Timer Control Register 0</description>
          <addressOffset>0x1104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WINSEL</name>
              <description>Close Window Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIN0</name>
                  <description>In window mode field WINDOW0 of WDDTCTL0 defines the closed window size.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIN1</name>
                  <description>In window mode field WINDOW1 of WDDTCTL0 defines the closed window size.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDT0_WWDTCNTRST</name>
          <description>Window Watchdog Timer Counter Reset Register</description>
          <addressOffset>0x1108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESTART</name>
              <description>Window Watchdog Timer Counter Restart Writing 00A7h to this register restarts the WWDT Counter. 
Writing any other value causes an error generation to the ESM.
Read as 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDT0_WWDTSTAT</name>
          <description>Window Watchdog Timer Status Register</description>
          <addressOffset>0x110C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RUN</name>
              <description>Watchdog running status flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Watchdog counter stopped.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Watchdog running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
