exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <name>I2C1_TARGET_PECCTL</name>
            <description>I2C Target PEC control register</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PECCNT</name>
                <description>When this field is non zero, the number of I2C data bytes are counted. When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

In the normal Target use case, FW would set PECEN=1 and PECCNT=0 and use the ACKOEN until the remaining SMB packet length is known. FW would then set the PECCNT to the remaining packet length (Including PEC bye). FW would then configure DMA to allow the packet to complete unassisted and exit NoAck mode.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
              </field>
              <field>
                <name>PECEN</name>
                <description>PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits except the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>PEC transmission and check is disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>PEC transmission and check is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C1_TARGET_PECSR</name>
            <description>I2C Target PEC status register</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PECBYTECNT</name>
                <description>This is the current PEC Byte Count of the Target State Machine.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
              </field>
              <field>
                <name>PECSTS_CHECK</name>
                <description>This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLEARED</name>
                    <description>Indicates PEC was not checked in the transaction that occurred before the last Stop</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Indicates PEC was checked in the transaction that occurred before the last Stop</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PECSTS_ERROR</name>
                <description>This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLEARED</name>
                    <description>Indicates PEC check error did not occurr in the transaction that occurred before the last Stop</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Indicates PEC check error occurred in the transaction that occurred before the last Stop</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>EVENTLP</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>EVENTLP</groupName>
      <baseAddress>0x400C9000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EVENTLP_PUBCFG_DESC_EX</name>
          <description>Extended Module Description</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NUM_SINGLE_CHANNEL</name>
              <description>Number of single channels contained in this instance of event manager</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_DUAL_CHANNEL</name>
              <description>Number of dual channels contained in this instance of event manager</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_IMPORT</name>
              <description>Number of import ports available in this EventManager instantiation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_EXPORT</name>
              <description>Number of export ports available in this EventManager instantiation</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTLP_PUBCFG_DESC</name>
          <description>Module Description</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MINREV</name>
              <description>Minor rev of the IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>Major rev of the IP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INSTNUM</name>
              <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FEATUREVER</name>
              <description>Feature Set for the module *instance*</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MODULEID</name>
              <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x64</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_PUBCFG_FSUB[%s]</name>
          <addressOffset>0x100</addressOffset>
          <register>
            <dim>25</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>EVENTLP_PUBCFG_FSUB_PORT[%s]</name>
            <description>Subscriber channel ID register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for subscriber to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x54</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_PUBCFG_FPUB[%s]</name>
          <addressOffset>0x300</addressOffset>
          <register>
            <dim>21</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>EVENTLP_PUBCFG_FPUB_PORT[%s]</name>
            <description>Publisher channel ID register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for publisher to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_PUBCFG_EXPORT[%s]</name>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>EVENTLP_PUBCFG_EXPORT_PORT</name>
            <description>Export channel ID register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for export side to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_PUBCFG_IMPORT[%s]</name>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>EVENTLP_PUBCFG_IMPORT_PORT</name>
            <description>Import channel ID registe</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for import side to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x6C</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_PUBCFG_CPU_CONNECT[%s]</name>
          <addressOffset>0x900</addressOffset>
          <register>
            <dim>27</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>EVENTLP_PUBCFG_CPU_NUM[%s]</name>
            <description>CPU connect register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
          </register>
        </cluster>
        <register>
          <name>EVENTLP_SECCFG_DESC_EX</name>
          <description>Extended Module Description</description>
          <addressOffset>0x10F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NUM_SINGLE_CHANNEL</name>
              <description>Number of single channels contained in this instance of event manager</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_DUAL_CHANNEL</name>
              <description>Number of dual channels contained in this instance of event manager</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_EXPORT</name>
              <description>Number of export ports available in this EventManager instantiation</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_IMPORT</name>
              <description>Number of import ports available in this EventManager instantiation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTLP_SECCFG_DESC</name>
          <description>Module Description</description>
          <addressOffset>0x10FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MINREV</name>
              <description>Minor rev of the IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>Major rev of the IP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INSTNUM</name>
              <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FEATUREVER</name>
              <description>Feature Set for the module *instance*</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MODULEID</name>
              <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x19</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_SECCFG_FSUB[%s]</name>
          <addressOffset>0x1100</addressOffset>
          <register>
            <dim>25</dim>
            <dimIncrement>0x1</dimIncrement>
            <dimArrayIndex/>
            <name>EVENTLP_SECCFG_FSUB_PORT[%s]</name>
            <description>Subscriber channel ID register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for subscriber to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x15</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_SECCFG_FPUB[%s]</name>
          <addressOffset>0x1180</addressOffset>
          <register>
            <dim>21</dim>
            <dimIncrement>0x1</dimIncrement>
            <dimArrayIndex/>
            <name>EVENTLP_SECCFG_FPUB_PORT[%s]</name>
            <description>Publisher channel ID register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for publisher to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_SECCFG_EXPORT[%s]</name>
          <addressOffset>0x1200</addressOffset>
          <register>
            <name>EVENTLP_SECCFG_EXPORT_PORT</name>
            <description>Export channel ID register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for export side to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_SECCFG_IMPORT[%s]</name>
          <addressOffset>0x1280</addressOffset>
          <register>
            <name>EVENTLP_SECCFG_IMPORT_PORT</name>
            <description>Import channel ID registe</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHANID</name>
                <description>Channel ID for import side to connect to</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x1B</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_SECCFG_CPU_CONNECT[%s]</name>
          <addressOffset>0x1300</addressOffset>
          <register>
            <dim>27</dim>
            <dimIncrement>0x1</dimIncrement>
            <dimArrayIndex/>
            <name>EVENTLP_SECCFG_CPU_NUM[%s]</name>
            <description>CPU connect register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
          </register>
        </cluster>
        <register>
          <name>EVENTLP_CTL</name>
          <description>Event Manager control register</description>
          <addressOffset>0x1400</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVRWR_EN</name>
              <description>Enable overwrite of config even if resources are already configured. By default, a configuration cannot be overwritten.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Overwrite is disabled. Mode is same as in UNASG aperture.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Ovewrite is enabled</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x400</dimIncrement>
          <dimArrayIndex/>
          <name>EVENTLP_LMGMT_SFTYDIAG[%s]</name>
          <addressOffset>0x1C00</addressOffset>
          <register>
            <name>EVENTLP_DIAGPAR192</name>
            <description>Diagnostic Parity Register 768</description>
            <addressOffset>0xEC</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ASSERTDIAG</name>
                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>No Effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>START</name>
                    <description>Generate diagnostic check</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
