exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>GPIOA</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1F00</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>INT_GROUP1</name>
        <description>GPIOA interrupt (group 1, IIDX 0)</description>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>GPIOA_FSUB_0</name>
          <description>Subsciber Port 0</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_FSUB_1</name>
          <description>Subscriber Port 1</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_FPUB_0</name>
          <description>Publisher Port 0</description>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_FPUB_1</name>
          <description>Publisher Port 1</description>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimArrayIndex/>
          <name>GPIOA_GPRCM[%s]</name>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>GPIOA_PWREN</name>
            <description>Power enable</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the power</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable Power</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable Power</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for GPIOA power enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCK</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock pwren</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock pwren</description>
                    <value>38</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GPIOA_RSTCTL</name>
            <description>Reset Control</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>RESETSTKYCLR</name>
                <description>Clear the RESETSTKY bit in the STAT register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear reset sticky bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETASSERT</name>
                <description>Assert reset to the peripheral</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ASSERT</name>
                    <description>Assert reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for GPIOA reset control</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCKW</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock reset</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock reset</description>
                    <value>177</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GPIOA_STAT</name>
            <description>Status Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>RESETSTKY</name>
                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORES</name>
                    <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>The peripheral was reset since the last bit clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>GPIOA_CLKOVR</name>
          <description>Clock Override</description>
          <addressOffset>0x1010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVERRIDE</name>
              <description>Unlocks the functionality of [RUN_STOP] to override the automatic peripheral clock request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Override disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Override enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUN_STOP</name>
              <description>If [OVERRIDE] is enabled, this register is used to manually control the peripheral's clock request to the system</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Run/ungate functional clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop/gate functional clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_PDBGCTL</name>
          <description>Peripheral Debug Control</description>
          <addressOffset>0x1018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FREE</name>
              <description>Free run control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>The peripheral ignores the state of the Core Halted input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>GPIOA_CPU_INT[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>GPIOA_CPU_INT_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No bit is set means there is no pending interrupt request</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO0</name>
                    <description>DIO0 interrupt</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO1</name>
                    <description>DIO1 interrupt</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO2</name>
                    <description>DIO2 interrupt</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO3</name>
                    <description>DIO3 interrupt</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO4</name>
                    <description>DIO4 interrupt</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO5</name>
                    <description>DIO5 interrupt</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO6</name>
                    <description>DIO6 interrupt</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO7</name>
                    <description>DIO7 interrupt</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO8</name>
                    <description>DIO8 interrupt</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO9</name>
                    <description>DIO9 interrupt</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO10</name>
                    <description>DIO10 interrupt</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO11</name>
                    <description>DIO11 interrupt</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO12</name>
                    <description>DIO12 interrupt</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO13</name>
                    <description>DIO13 interrupt</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO14</name>
                    <description>DIO14 interrupt</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO15</name>
                    <description>DIO15 interrupt</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO16</name>
                    <description>DIO16 interrupt</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO17</name>
                    <description>DIO17 interrupt</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO18</name>
                    <description>DIO18 interrupt</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO19</name>
                    <description>DIO19 interrupt</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO20</name>
                    <description>DIO20 interrupt</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO21</name>
                    <description>DIO21 interrupt</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO22</name>
                    <description>DIO22 interrupt</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO23</name>
                    <description>DIO23 interrupt</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO24</name>
                    <description>DIO24 interrupt</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO25</name>
                    <description>DIO25 interrupt</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO26</name>
                    <description>DIO26 interrupt</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO27</name>
                    <description>DIO27 interrupt</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO28</name>
                    <description>DIO28 interrupt</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO29</name>
                    <description>DIO29 interrupt</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO30</name>
                    <description>DIO30 interrupt</description>
                    <value>31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO31</name>
                    <description>DIO31 interrupt</description>
                    <value>32</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
