exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>I2C0_CPU_INT[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>I2C0_CPU_INT_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRXDONEFG</name>
                    <description>Controller data received</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTXDONEFG</name>
                    <description>Controller data transmitted</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRXFIFOTRG</name>
                    <description>Controller receive FIFO Trigger Level</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTXFIFOTRG</name>
                    <description>Controller transmit FIFO Trigger level</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRXFIFOFULL</name>
                    <description>RX FIFO FULL Event/interrupt pending</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTX_EMPTY</name>
                    <description>Transmit FIFO/Buffer Empty Event/interrupt pending</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNACKFG</name>
                    <description>Address/Data NACK</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CSTARTFG</name>
                    <description>Start Event</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CSTOPFG</name>
                    <description>Stop Event</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CARBLOSTFG</name>
                    <description>Arbitration Lost</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CDMA_DONE_TX</name>
                    <description>DMA DONE on Channel TX</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CDMA_DONE_RX</name>
                    <description>DMA DONE on Channel RX</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CPEC_RX_ERR</name>
                    <description>Controller PEC Receive Error Event</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMEOUTA</name>
                    <description>Timeout A Event</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMEOUTB</name>
                    <description>Timeout B Event</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRXDONEFG</name>
                    <description>Target Data Event</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TTXDONEFG</name>
                    <description>Target Data Event</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRXFIFOTRG</name>
                    <description>Target receive FIFO Trigger Level</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TTXFIFOTRG</name>
                    <description>Target transmit FIFO Trigger level</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRXFIFOFULL</name>
                    <description>RX FIFO FULL Event/interrupt pending</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TTXEMPTY</name>
                    <description>Transmit FIFO/Buffer Empty Event/interrupt pending</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TSTARTFG</name>
                    <description>Start Event</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TSTOPFG</name>
                    <description>Stop Event</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TGENCALL</name>
                    <description>General Call Event</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TDMA_DONE_TX</name>
                    <description>DMA DONE on Channel TX</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TDMA_DONE_RX</name>
                    <description>DMA DONE on Channel RX</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TPEC_RX_ERR</name>
                    <description>Target PEC receive error event</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TTX_UNFL</name>
                    <description>Target TX FIFO underflow</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRX_OVFL</name>
                    <description>Target RX FIFO overflow event</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TARBLOST</name>
                    <description>Target arbitration lost event</description>
                    <value>31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTR_OVFL</name>
                    <description>Interrupt overflow event</description>
                    <value>32</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
