exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>I2C0_DMA_TRIG1[%s]</name>
          <addressOffset>0x1050</addressOffset>
          <register>
            <name>I2C0_DMA_TRIG1_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRXFIFOTRG</name>
                    <description>Controller receive FIFO Trigger Level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTXFIFOTRG</name>
                    <description>Controller transmit FIFO Trigger level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRXFIFOTRG</name>
                    <description>Target receive FIFO Trigger Level</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TTXFIFOTRG</name>
                    <description>Target transmit FIFO Trigger level</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C0_DMA_TRIG1_IMASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRXFIFOTRG</name>
                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTXFIFOTRG</name>
                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRXFIFOTRG</name>
                <description>Target Receive FIFO Trigger</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TTXFIFOTRG</name>
                <description>Target Transmit FIFO Trigger</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C0_DMA_TRIG1_RIS</name>
            <description>Raw interrupt status</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRXFIFOTRG</name>
                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTXFIFOTRG</name>
                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRXFIFOTRG</name>
                <description>Target Receive FIFO Trigger</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TTXFIFOTRG</name>
                <description>Target Transmit FIFO Trigger</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C0_DMA_TRIG1_MIS</name>
            <description>Masked interrupt status</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRXFIFOTRG</name>
                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTXFIFOTRG</name>
                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRXFIFOTRG</name>
                <description>Target Receive FIFO Trigger</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TTXFIFOTRG</name>
                <description>Target Transmit FIFO Trigger</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C0_DMA_TRIG1_ISET</name>
            <description>Interrupt set</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRXFIFOTRG</name>
                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTXFIFOTRG</name>
                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRXFIFOTRG</name>
                <description>Target Receive FIFO Trigger</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TTXFIFOTRG</name>
                <description>Target Transmit FIFO Trigger</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C0_DMA_TRIG1_ICLR</name>
            <description>Interrupt clear</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRXFIFOTRG</name>
                <description>Controller Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTXFIFOTRG</name>
                <description>Controller Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRXFIFOTRG</name>
                <description>Target Receive FIFO Trigger</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TTXFIFOTRG</name>
                <description>Target Transmit FIFO Trigger</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>I2C0_DMA_TRIG0[%s]</name>
          <addressOffset>0x1080</addressOffset>
          <register>
            <name>I2C0_DMA_TRIG0_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRXFIFOTRG</name>
                    <description>Controller receive FIFO Trigger Level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTXFIFOTRG</name>
                    <description>Controller transmit FIFO Trigger level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRXFIFOTRG</name>
                    <description>Target receive FIFO Trigger Level</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TTXFIFOTRG</name>
                    <description>Target transmit FIFO Trigger level</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
