exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>I2C0_GFCTL</name>
          <description>I2C Glitch Filter Control</description>
          <addressOffset>0x1200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AGFSEL</name>
              <description>Analog Glitch Suppression Pulse Width

This field controls the pulse width select for the analog glitch suppression on SCL and SDA lines. 
See device datasheet for exact values.
(ULP I2C only)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AGLIT_5</name>
                  <description>Pulses shorter then 5ns length are filtered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGLIT_10</name>
                  <description>Pulses shorter then 10ns length are filtered.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGLIT_25</name>
                  <description>Pulses shorter then 25ns length are filtered.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AGLIT_50</name>
                  <description>Pulses shorter then 50ns length are filtered.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DGFSEL</name>
              <description>Glitch Suppression Pulse Width
 
This field controls the pulse width select for glitch suppression on the SCL and SDA lines. The following values are the glitch suppression values in terms of functional clocks.
  
(Core Domain only)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_1</name>
                  <description>1 clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_2</name>
                  <description>2 clocks</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_3</name>
                  <description>3 clocks</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_4</name>
                  <description>4 clocks</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_8</name>
                  <description>8 clocks</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_16</name>
                  <description>16 clocks</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_31</name>
                  <description>31 clocks</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGFEN</name>
              <description>Analog Glitch Suppression Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Analog Glitch Filter disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Analog Glitch Filter enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHAIN</name>
              <description>Analog and digital noise filters chaining enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>When 0, chaining is disabled and only digital filter output is available to IP logic for oversampling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>When 1, analog and digital glitch filters are chained and the output of the combination is made available to IP logic for oversampling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C0_TIMEOUT_CTL</name>
          <description>I2C Timeout Count Control Register</description>
          <addressOffset>0x1204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00020002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCNTLA</name>
              <description>Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 

