exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>UART2_INT_EVENT0[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>UART2_INT_EVENT0_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>UART Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MIS registers. 15h-1Fh = Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RTFG</name>
                    <description>UART receive time-out interrupt; Interrupt Flag: RT; Interrupt Priority: Highest</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FEFG</name>
                    <description>UART framing error interrupt; Interrupt Flag: FE</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PEFG</name>
                    <description>UART parity error interrupt; Interrupt Flag: PE</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BEFG</name>
                    <description>UART break error interrupt; Interrupt Flag: BE</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OEFG</name>
                    <description>UART receive overrun error interrupt; Interrupt Flag: OE</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RXNE</name>
                    <description>Negative edge on UARTxRXD interrupt; Interrupt Flag: RXNE</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RXPE</name>
                    <description>Positive edge on UARTxRXD interrupt; Interrupt Flag: RXPE</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LINC0</name>
                    <description>LIN capture 0 / match interrupt; Interrupt Flag: LINC0</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LINC1</name>
                    <description>LIN capture 1 interrupt; Interrupt Flag: LINC1</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LINOVF</name>
                    <description>LIN hardware counter overflow interrupt; Interrupt Flag: LINOVF</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RXIFG</name>
                    <description>UART receive interrupt; Interrupt Flag: RX</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TXIFG</name>
                    <description>UART transmit interrupt; Interrupt Flag: TX</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EOT</name>
                    <description>UART end of transmission interrupt (transmit serializer empty); Interrupt Flag: EOT</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MODE_9B</name>
                    <description>9-bit mode address match interrupt; Interrupt Flag: MODE_9B</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTS</name>
                    <description>UART Clear to Send Modem interrupt; Interrupt Flag: CTS</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMA_DONE_RX</name>
                    <description>DMA DONE on RX</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMA_DONE_TX</name>
                    <description>DMA DONE on TX</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NERR_EVT</name>
                    <description>Noise Error Event</description>
                    <value>18</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>UART2_INT_EVENT0_IMASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FRMERR</name>
                <description>Enable UART Framing Error Interrupt.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PARERR</name>
                <description>Enable UART Parity Error Interrupt.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BRKERR</name>
                <description>Enable UART Break Error Interrupt.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OVRERR</name>
                <description>Enable UART Receive Overrun Error Interrupt.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXNE</name>
                <description>Enable Negative Edge on UARTxRXD Interrupt.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXPE</name>
                <description>Enable Positive Edge on UARTxRXD Interrupt.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXINT</name>
                <description>Enable UART Receive Interrupt.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXINT</name>
                <description>Enable UART Transmit Interrupt.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EOT</name>
                <description>Enable UART End of Transmission Interrupt Indicates that the last bit of all transmitted data and flags has left the serializer and without any further Data in the TX Fifo or Buffer.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADDR_MATCH</name>
                <description>Enable Address Match Interrupt.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTS</name>
                <description>Enable UART Clear to Send Modem Interrupt.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMA_DONE_RX</name>
                <description>Enable DMA Done on RX Event Channel Interrupt</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMA_DONE_TX</name>
                <description>Enable DMA Done on TX Event Channel Interrupt</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTOUT</name>
                <description>Enable UARTOUT Receive Time-Out Interrupt.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NERR</name>
                <description>Noise Error on triple voting. Asserted when the 3 samples of majority voting are not equal</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
