exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC0_SVT</name>
      <version>1.0</version>
      <description>PERIPHERALREGIONSVT</description>
      <groupName>ADC</groupName>
      <baseAddress>0x4055A000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC0_SVT_FIFODATA</name>
          <description>FIFO Data Register</description>
          <addressOffset>0x556160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex/>
          <name>ADC0_SVT_MEMRES[%s]</name>
          <description>Memory Result Register</description>
          <addressOffset>0x556280</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>MEMRES result register.
If DF = 0, unsigned binary:
The conversion results are right aligned. In 10 and 8 bit modes, the unused MSB bits are forced to 0. 
If DF = 1, 2s-complement format:
The conversion results are left aligned. In 10 and 8 bit modes, the unused LSB bits are forced to 0.
The data is stored in the right-justified format and is converted to the left-justified 2s-complement format during read back.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSMEM</name>
      <version>1.0</version>
      <description>MEM</description>
      <groupName>SYSMEM</groupName>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers/>
    </peripheral>
    <peripheral>
      <name>SPI0</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40468000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1F00</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI0</name>
        <value>9</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimArrayIndex/>
          <name>SPI0_GPRCM[%s]</name>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>SPI0_PWREN</name>
            <description>Power enable</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the power</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable Power</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable Power</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for SPI0 power enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCK</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock pwren</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock pwren</description>
                    <value>38</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI0_RSTCTL</name>
            <description>Reset Control</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RESETSTKYCLR</name>
                <description>Clear the RESETSTKY bit in the STAT register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear reset sticky bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETASSERT</name>
                <description>Assert reset to the peripheral</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ASSERT</name>
                    <description>Assert reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for SPI0 reset control</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCKW</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock reset</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock reset</description>
                    <value>177</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI0_CLKCFG</name>
            <description>Peripheral Clock Configuration Register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>BLOCKASYNC</name>
                <description>Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Not block async clock request</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Block async clock request</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for SPI0 clock config</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCK</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock config</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock config</description>
                    <value>169</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SPI0_GPRCM_STAT</name>
            <description>Status Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>RESETSTKY</name>
                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORES</name>
                    <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>The peripheral was reset since the last bit clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SPI0_CLKDIV</name>
          <description>Clock Divider</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>Selects divide ratio of module clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_1</name>
                  <description>Do not divide clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide clock source by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_3</name>
                  <description>Divide clock source by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>Divide clock source by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_5</name>
                  <description>Divide clock source by 5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_6</name>
                  <description>Divide clock source by 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_7</name>
                  <description>Divide clock source by 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>Divide clock source by 8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI0_CLKSEL</name>
          <description>Clock Select for Ultra Low Power peripherals</description>
          <addressOffset>0x1004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFCLK_SEL</name>
              <description>Selects LFCLK as clock source if enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Does not select this clock as a source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Select this clock as a source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFCLK_SEL</name>
              <description>Selects MFCLK as clock source if enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Does not select this clock as a source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Select this clock as a source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCLK_SEL</name>
              <description>Selects SYSCLK as clock source if enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Does not select this clock as a source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Select this clock as a source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI0_PDBGCTL</name>
          <description>Peripheral Debug Control</description>
          <addressOffset>0x1018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FREE</name>
              <description>Free run control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>The peripheral ignores the state of the Core Halted input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFT</name>
              <description>Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAYED</name>
                  <description>The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>SPI0_CPU_INT[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>SPI0_CPU_INT_IIDX</name>
            <description>Interrupt Index Register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RXFIFO_OFV_EVT</name>
                    <description>RX FIFO Overflow Event/interrupt pending</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PER_EVT</name>
                    <description>Transmit Parity Event/interrupt pending</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RTOUT_EVT</name>
                    <description>SPI receive time-out interrupt</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RX_EVT</name>
                    <description>Receive Event/interrupt pending</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TX_EVT</name>
                    <description>Transmit Event/interrupt pending</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TX_EMPTY</name>
                    <description>Transmit Buffer Empty Event/interrupt pending</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLE_EVT</name>
                    <description>End of Transmit Event/interrupt pending</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMA_DONE_RX_EVT</name>
                    <description>DMA Done for Receive Event/interrupt pending</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMA_DONE_TX_EVT</name>
                    <description>DMA Done for Transmit Event/interrupt pending</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TXFIFO_UNF_EVT</name>
                    <description>TX FIFO underflow interrupt</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RXFULL_EVT</name>
                    <description>RX FIFO Full Interrupt</description>
                    <value>11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
