exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>KEYSTORECTL</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>KEYSTORECTL</groupName>
      <baseAddress>0x400AC000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KEYSTORECTL_CFG</name>
          <description>Keystore configuration</description>
          <addressOffset>0x1100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>NK256</name>
              <description>Number of 256 bit keys to be held in the key-store.
Can not exceed the total number of slots present in the hardware / 2.
For eg: if SYS_N_SLOTS = 4, then atmost 2 256-bit keys can be held in the key-store.
Incorrect setting of this field will be reported via STATUS register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>No 256-bit keys</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>One 256-bit key</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Two 256-bit keys</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Three 256-bit keys</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Four 256-bit keys</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSTORECTL_KEYWR</name>
          <description>Key write configuration</description>
          <addressOffset>0x1104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEYSZSEL</name>
              <description>Key size selection. Selection of 128 or 256 bit keys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K256</name>
                  <description>256 bit key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K128</name>
                  <description>128 bit key</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYSLOTSEL</name>
              <description>Select the key slot to write the key into.
NOTE: SW needs to ensure that it is writing to the correct slots. The slot numbering is from 0 through SYS_N_SLOTS-1.
Each slot is a 128-bit slot. Therefore, when writing a 256-bit key, two slots will need to budgeted.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOT0</name>
                  <description>Slot 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT1</name>
                  <description>Slot 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT2</name>
                  <description>Slot 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT3</name>
                  <description>Slot 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT4</name>
                  <description>Slot 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT5</name>
                  <description>Slot 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT6</name>
                  <description>Slot 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT7</name>
                  <description>Slot 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSTORECTL_KEYRD</name>
          <description>Key read configuration</description>
          <addressOffset>0x1108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEYSZSEL</name>
              <description>Key size selection. Selection of 128 or 256 bit keys</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K256</name>
                  <description>256 bit key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K128</name>
                  <description>128 bit key</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYSLOTSEL</name>
              <description>Select the key slot to read the key from.
NOTE: SW needs to ensure that it is reading from the correct slots. The slot numbering is from 0 through SYS_N_SLOTS-1.
Each slot is a 128-bit slot. Therefore, when reading a 256-bit key, two adjacent slots will be read.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CRYPTOSEL</name>
              <description>Crypto engine selector</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES</name>
                  <description>Transfer key to AES</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSTORECTL_STATUS</name>
          <description>Status</description>
          <addressOffset>0x110C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00020001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>Status information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid configuration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CFG</name>
                  <description>Key-store has not been configured. NK256 has not been set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_NK256</name>
                  <description>Invalid value for NK256 field in CFG.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_RECEIVE</name>
                  <description>Busy receiving a key deposit</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_TRANSMIT</name>
                  <description>Busy transmitting a key to a crypto engine</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_KEYSLOTSELW</name>
                  <description>Invalid keyslot selection for writing</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_KEYSLOTSELR</name>
                  <description>Invalid keyslot selection for reading</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Bitvector of valid bits to indicate which slots have been configured</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NKEYSLOTS</name>
              <description>Size of keystorage: Number of 128-bit key slots</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Two slots</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Three slots</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Four slots</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSTORECTL_KEYIN</name>
          <description>Input key</description>
          <addressOffset>0x1110</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
