exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRNG</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>TRNG</groupName>
      <baseAddress>0x40444000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1E00</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>INT_GROUP1</name>
        <description>TRNG interrupt (group 1, IIDX 5)</description>
        <value>1</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimArrayIndex/>
          <name>TRNG_GPRCM[%s]</name>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>TRNG_PWREN</name>
            <description>Power enable</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the power</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable Power</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable Power</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for TRNG power enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCK</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock pwren</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock pwren</description>
                    <value>38</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRNG_RSTCTL</name>
            <description>Reset Control</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RESETSTKYCLR</name>
                <description>Clear the RESETSTKY bit in the STAT register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear reset sticky bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETASSERT</name>
                <description>Assert reset to the peripheral</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ASSERT</name>
                    <description>Assert reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for TRNG reset control</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCKW</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock reset</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock reset</description>
                    <value>177</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TRNG_GPRCM_STAT</name>
            <description>Status Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>RESETSTKY</name>
                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORES</name>
                    <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>The peripheral was reset since the last bit clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TRNG_IIDX</name>
          <description>Interrupt index</description>
          <addressOffset>0x1020</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>STAT</name>
              <description>Interrupt index status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INTR</name>
                  <description>No bit is set means there is no pending interrupt request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQ_HEALTH_FAIL</name>
                  <description>Indicates that a health test has failed. The TRNG is in an error state until the interrupt is cleared.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQ_CMD_FAIL</name>
                  <description>Indicates that the just issued command was rejected and is not being performed.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQ_CMD_DONE</name>
                  <description>Indicates that the current command/mode is done. This may have different meanings based on the mode: OFF --&gt; Power has been turned off PWRUP_DIG --&gt; Digital powerup tests are done PWRUP_ANA --&gt; Analog powerup tests are done NORM_FUNC --&gt; No IRQ, since mode runs indefinitely until a new command is issued</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRQ_CAPTURED_RDY</name>
                  <description>Indicates that the captured word buffer is ready to be copied to memory</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_IMASK</name>
          <description>Interrupt mask</description>
          <addressOffset>0x1028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IRQ_HEALTH_FAIL</name>
              <description>Mask for IRQ_HEALTH_FAIL. Indicates that a health test has failed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Interrupt is masked out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Interrupt will request an interrupt service routine and corresponding bit in MIS will be set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_CAPTURED_RDY</name>
              <description>Mask for IRQ_CAPTURED_RDY. Indicates to the CPU that the Captured Word is ready to be read.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Interrupt is masked out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Interrupt will request an interrupt service routine and corresponding bit in MIS will be set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_CMD_DONE</name>
              <description>Mask for IRQ_CMD_DONE. Indicates that a command has finished</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Interrupt is masked out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Interrupt will request an interrupt service routine and corresponding bit in MIS will be set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_CMD_FAIL</name>
              <description>Masked interrupt source for IRQ_CMD_FAIL. Indicates that the just issued command/mode has been rejected.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Interrupt is masked out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Interrupt will request an interrupt service routine and corresponding bit in MIS will be set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_RIS</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x1030</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IRQ_CAPTURED_RDY</name>
              <description>Indicates to the CPU that the Captured Word is ready to be read. Reading the IIDX will clear this interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CAPTURED_READY did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CAPTURED_READY occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_HEALTH_FAIL</name>
              <description>Indicates to the CPU that any of the health tests have failed. Reading the IIDX  will clear this interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CAPTURED_READY did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CAPTURED_READY occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_CMD_DONE</name>
              <description>Raw interrupt source for IRQ_CMD_DONE. Indicates that the issued command/mode has completed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CMD_DONE did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CMD_DONE occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_CMD_FAIL</name>
              <description>Masked interrupt source for IRQ_CMD_FAIL. Indicates that the just issued command/mode has been rejected.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CMD_FAIL did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CMD_FAIL occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_MIS</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x1038</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>IRQ_CAPTURED_RDY</name>
              <description>Masked interrupt result for CAPTURED_READY. Indicates to the CPU that the Captured Word is ready to be read. Reading the IIDX  will clear this interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CAPTURED_READY did not request an interrupt service routine</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CAPTURED_READY requests an interrupt service routine</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_HEALTH_FAIL</name>
              <description>Masked interrupt result for HEALTH_FAIL. Indicates to the CPU that any of the health tests have failed for the latest 1024-bit window.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CAPTURED_READY did not request an interrupt service routine</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CAPTURED_READY requests an interrupt service routine</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_CMD_DONE</name>
              <description>Masked interrupt source for IRQ_CMD_DONE. Indicates that the issued command/mode has completed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CAPTURED_READY did not request an interrupt service routine</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CMD_DONE requests an interrupt service routine</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ_CMD_FAIL</name>
              <description>Masked interrupt source for IRQ_CMD_FAIL. Indicates that the just issued command/mode has been rejected.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>IRQ_CMD_FAIL did not request an interrupt service routine</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>IRQ_CMD_FAIL requests an interrupt service routine</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
