exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
b00 = Disabled
b01 = 20 us PCHARGE
b10 = 30 us PCHARGE (default)
b11 = 40 us PCHARGE</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRUP_PSTART_CFG</name>
              <description>Configure pusle startup sequence length

b00 = Disabled
b01 = rise at 10us, fall at 50us
b10 = rise at 10us, fall at 70us (default)
b11 = rise at 10us, fall at 90us</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Sets the TRNG mode through a command. The mode will not be updated until the previous command is done, as indicated by IRQ_CMD_DONE.
00 --&gt; OFF
01 --&gt; PWRUP_DIG
10 --&gt; PWRUP_ANA
11 --&gt; NORM_FUNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_OFF</name>
                  <description>Turns the power off of the analog source and clocks the digital interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRUP_DIG</name>
                  <description>Initiates the powerup test sequence for the digital components. This verifies that the digital components are properly working. IRQ_CMD_DONE indicates that the test is done. The results of this test are in bits 0:6 in TEST_RESULTS register</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRUP_ANA</name>
                  <description>Initiates the powerup test sequence for the analog TRNG. This verifies that the analog component is generating sequences with enough entropy. IRQ_CMD_DONE indicates that the test is done. The results of this test are in bit 7 in TEST_RESULTS register</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORM_FUNC</name>
                  <description>Normal operating mode for TRNG. All components are turned on.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_STAT</name>
          <description>Status register that informs health test results and last issued command</description>
          <addressOffset>0x1104</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0303</resetMask>
          <fields>
            <field>
              <name>ADAP_FAIL</name>
              <description>Indicates that the Adaptive Proportion Test (1,2,3, or 4-bit counters) failed by having too many or too few counted samples in the last 1024 bit window.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISSUED_CMD</name>
              <description>Indicates the last accepted command that is issued to the TRNG interface.
Upon writing a valid command, this register will update and the command will be in progress until CMD_DONE_IRQ is set.
CMD_DONE_IRQ indicates that the state is in PWROFF, NORM_FUNC, or ERROR. These states will accept new commands.
00 --&gt; OFF
01 --&gt; PWRUP_DIG
10 --&gt; PWRUP_ANA
11 --&gt; NORM_FUNC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_STATE</name>
              <description>Current state of the front end FSM (behind a clock domain crossing).
2 reads are REQUIRED as there is a chance of metastability when reading this
States:
0000: OFF
0001: PWRUP_ES
0011: NORM_FUNC
0111: TEST_DIG
1011: TEST_ANA
1010: ERROR
0010: PWRDOWN_ES</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REP_FAIL</name>
              <description>Indicates that the repetition counter test caused the most recent failure. Thus, the health count numbers are most likely not for a complete 1024-bit window.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_DATA_CAPTURE</name>
          <description>Captured word buffer of RNG data</description>
          <addressOffset>0x1108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>TRNG_TEST_RESULTS</name>
          <description>Test results from TEST_ANA and TEST_DIG</description>
          <addressOffset>0x110C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>DIG_TEST</name>
              <description>Bit 0 indicates if the first decimation rate test and health test(verifies conditioning, decimation, and captured buffer) fails and Bit 1 indicates if the second decimation test and health test fails
Bit 0 - decim_test0 (decim = 0x0)
Bit 1 - decim_test1 (decim = 0x1) ...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ANA_TEST</name>
              <description>Runs through 4096 samples from an enabled entropy source and verifies that none of the health tests failed, indicating sufficient entropy was produced by the analog components</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_CLKDIVIDE</name>
          <description>Clock Divider</description>
          <addressOffset>0x1110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>Selects divide ratio of module clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_1</name>
                  <description>Do not divide clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide clock source by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>Divide clock source by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_6</name>
                  <description>Divide clock source by 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>Divide clock source by 8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
