exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
TPR is the Timer Period register value (range of 1 to 127).

  SCL_LP is the SCL Low period (fixed at 6).
  
SCL_HP is the SCL High period (fixed at 4).

  CLK_PRD is the functional clock period in ns.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C2_CCR</name>
            <description>I2C Controller Configuration</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LPBK</name>
                <description>I2C Loopback</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Normal operation.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>The controller in a test mode loopback configuration.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MCTL</name>
                <description>MultiController mode. In MultiController mode the SCL high time counts once the SCL line has been detected high. If this is not enabled the high time counts as soon as the SCL line has been set high by the I2C controller.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable MultiController mode.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable MultiController mode.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACTIVE</name>
                <description>Device Active  After this bit has been set, it should not be set again unless it has been cleared by writing a 0 or by a reset, otherwise transfer failures may occur.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disables the I2C Controller operation.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enables the I2C Controller operation.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLKSTRETCH</name>
                <description>Clock Stretching. This bit controls the support for clock stretching of the I2C bus.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disables the clock stretching detection. This can be disabled if no Target on the bus does support clock stretching, so that the maximum speed on the bus can be reached.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enables the clock stretching detection. Enabling the clock stretching ensures compliance to the I2C standard but could limit the speed due the clock stretching.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C2_CBMON</name>
            <description>I2C Controller Bus Monitor</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000003</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SCL</name>
                <description>I2C SCL Status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLEARED</name>
                    <description>The I2CSCL signal is low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>The I2CSCL signal is high. Note: During and right after reset, the SCL pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDA</name>
                <description>I2C SDA Status</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLEARED</name>
                    <description>The I2CSDA signal is low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>The I2CSDA signal is high. Note: During and right after reset, the SDA pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C2_CFIFOCTL</name>
            <description>I2C Controller FIFO Control</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXTRIG</name>
                <description>TX FIFO Trigger
Indicates at what fill level in the TX FIFO a trigger will be generated.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EMPTY</name>
                    <description>Trigger when the TX FIFO is empty.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_1</name>
                    <description>Trigger when TX FIFO contains  1 byte</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_2</name>
                    <description>Trigger when TX FIFO contains  2 byte</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_3</name>
                    <description>Trigger when TX FIFO contains  3 byte</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_4</name>
                    <description>Trigger when TX FIFO contains  4 byte</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_5</name>
                    <description>Trigger when TX FIFO contains  5 byte</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_6</name>
                    <description>Trigger when TX FIFO contains  6 byte</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_7</name>
                    <description>Trigger when TX FIFO contains  7 byte</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXFLUSH</name>
                <description>TX FIFO Flush
Setting this bit will Flush the TX FIFO. 
Before clearing this bit to stop Flush the TXFIFOCNT should be checked to be 8 and indicating that the Flush has completed.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOFLUSH</name>
                    <description>Do not Flush FIFO</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLUSH</name>
                    <description>Flush FIFO</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXTRIG</name>
                <description>RX FIFO Trigger
Indicates at what fill level in the RX FIFO a trigger will be generated.
Note: Programming RXTRIG to 0x0 has no effect since no data is
present to transfer out of RX FIFO.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LEVEL_1</name>
                    <description>Trigger when RX FIFO contains &gt;= 1 byte</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_2</name>
                    <description>Trigger when RX FIFO contains &gt;= 2 byte</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_3</name>
                    <description>Trigger when RX FIFO contains &gt;= 3 byte</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_4</name>
                    <description>Trigger when RX FIFO contains &gt;= 4 byte</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_5</name>
                    <description>Trigger when RX FIFO contains &gt;= 5 byte</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_6</name>
                    <description>Trigger when RX FIFO contains &gt;= 6 byte</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_7</name>
                    <description>Trigger when RX FIFO contains &gt;= 7 byte</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL_8</name>
                    <description>Trigger when RX FIFO contains &gt;= 8 byte</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RXFLUSH</name>
                <description>RX FIFO Flush
Setting this bit will Flush the RX FIFO.
Before clearing this bit to stop Flush the RXFIFOCNT should be checked to be 0 and indicating that the Flush has completed.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOFLUSH</name>
                    <description>Do not Flush FIFO</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FLUSH</name>
                    <description>Flush FIFO</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C2_CFIFOSR</name>
            <description>I2C Controller FIFO Status Register</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000800</resetValue>
            <fields>
              <field>
                <name>RXFIFOCNT</name>
                <description>Number of Bytes which could be read from the RX FIFO</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXFIFOCNT</name>
                <description>Number of Bytes which could be put into the TX FIFO</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXFLUSH</name>
                <description>RX FIFO Flush
When this bit is set a Flush operation for the RX FIFO is active. Clear the RXFLUSH bit in the control register to stop.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>FIFO Flush not active</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>FIFO Flush active</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXFLUSH</name>
                <description>TX FIFO Flush
When this bit is set a Flush operation for the TX FIFO is active. Clear the TXFLUSH bit in the control register to stop.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INACTIVE</name>
                    <description>FIFO Flush not active</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ACTIVE</name>
                    <description>FIFO Flush active</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>I2C2_CONTROLLER_I2CPECCTL</name>
            <description>I2C Controller PEC control register</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PECCNT</name>
                <description>PEC Count
When this field is non zero, the number of I2C bytes are counted (Note that although the PEC is calculated on the I2C address it is not counted at a byte). When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

In the normal Controller use case, FW would set PECEN=1 and PECCNT=SMB packet length (Not including Target Address byte, but including the PEC byte). FW would then configure DMA to allow the packet to complete unassisted and write MCTR to initiate the transaction.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction.

