exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>GPIOB_GEN_EVENT1[%s]</name>
          <addressOffset>0x1080</addressOffset>
          <register>
            <name>GPIOB_GEN_EVENT1_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No bit is set means there is no pending interrupt request</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO16</name>
                    <description>DIO0 interrupt</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO17</name>
                    <description>DIO1 interrupt</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO18</name>
                    <description>DIO2 interrupt</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO19</name>
                    <description>DIO3 interrupt</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO20</name>
                    <description>DIO4 interrupt</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO21</name>
                    <description>DIO5 interrupt</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO22</name>
                    <description>DIO6 interrupt</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO23</name>
                    <description>DIO7 interrupt</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO24</name>
                    <description>DIO8 interrupt</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO25</name>
                    <description>DIO9 interrupt</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO26</name>
                    <description>DIO10 interrupt</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO27</name>
                    <description>DIO11 interrupt</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO28</name>
                    <description>DIO12 interrupt</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO29</name>
                    <description>DIO13 interrupt</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO30</name>
                    <description>DIO14 interrupt</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO31</name>
                    <description>DIO15 interrupt</description>
                    <value>16</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GPIOB_GEN_EVENT1_IMASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DIO16</name>
                <description>DIO16 event mask</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO17</name>
                <description>DIO17 event mask</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO18</name>
                <description>DIO18 event mask</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO19</name>
                <description>DIO19 event mask</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO20</name>
                <description>DIO20 event mask</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO21</name>
                <description>DIO21 event mask</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO22</name>
                <description>DIO22 event mask</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO23</name>
                <description>DIO23 event mask</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO24</name>
                <description>DIO24 event mask</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO25</name>
                <description>DIO25 event mask</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO26</name>
                <description>DIO26 event mask</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO27</name>
                <description>DIO27 event mask</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO28</name>
                <description>DIO28 event mask</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO29</name>
                <description>DIO29 event mask</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO30</name>
                <description>DIO30 event mask</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIO31</name>
                <description>DIO31 event mask</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event is masked</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event is unmasked</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
