exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Input value is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOB_POLARITY15_0</name>
          <description>Polarity 15 to 0</description>
          <addressOffset>0x1390</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIO0</name>
              <description>Enables and configures edge detection polarity for DIO0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO1</name>
              <description>Enables and configures edge detection polarity for DIO1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO2</name>
              <description>Enables and configures edge detection polarity for DIO2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO3</name>
              <description>Enables and configures edge detection polarity for DIO3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO4</name>
              <description>Enables and configures edge detection polarity for DIO4.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO5</name>
              <description>Enables and configures edge detection polarity for DIO5.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO6</name>
              <description>Enables and configures edge detection polarity for DIO6.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO7</name>
              <description>Enables and configures edge detection polarity for DIO7.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO8</name>
              <description>Enables and configures edge detection polarity for DIO8.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO9</name>
              <description>Enables and configures edge detection polarity for DIO9.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO10</name>
              <description>Enables and configures edge detection polarity for DIO10.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO11</name>
              <description>Enables and configures edge detection polarity for DIO11.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO12</name>
              <description>Enables and configures edge detection polarity for DIO12.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO13</name>
              <description>Enables and configures edge detection polarity for DIO13.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO14</name>
              <description>Enables and configures edge detection polarity for DIO14.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO15</name>
              <description>Enables and configures edge detection polarity for DIO15.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
