exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>GPIOC_CPU_INT[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>GPIOC_CPU_INT_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No bit is set means there is no pending interrupt request</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO0</name>
                    <description>DIO0 interrupt</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO1</name>
                    <description>DIO1 interrupt</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO2</name>
                    <description>DIO2 interrupt</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO3</name>
                    <description>DIO3 interrupt</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO4</name>
                    <description>DIO4 interrupt</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO5</name>
                    <description>DIO5 interrupt</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO6</name>
                    <description>DIO6 interrupt</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO7</name>
                    <description>DIO7 interrupt</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO8</name>
                    <description>DIO8 interrupt</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO9</name>
                    <description>DIO9 interrupt</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO10</name>
                    <description>DIO10 interrupt</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO11</name>
                    <description>DIO11 interrupt</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO12</name>
                    <description>DIO12 interrupt</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO13</name>
                    <description>DIO13 interrupt</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO14</name>
                    <description>DIO14 interrupt</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO15</name>
                    <description>DIO15 interrupt</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO16</name>
                    <description>DIO16 interrupt</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO17</name>
                    <description>DIO17 interrupt</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO18</name>
                    <description>DIO18 interrupt</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO19</name>
                    <description>DIO19 interrupt</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO20</name>
                    <description>DIO20 interrupt</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO21</name>
                    <description>DIO21 interrupt</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO22</name>
                    <description>DIO22 interrupt</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO23</name>
                    <description>DIO23 interrupt</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO24</name>
                    <description>DIO24 interrupt</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO25</name>
                    <description>DIO25 interrupt</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO26</name>
                    <description>DIO26 interrupt</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO27</name>
                    <description>DIO27 interrupt</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO28</name>
                    <description>DIO28 interrupt</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO29</name>
                    <description>DIO29 interrupt</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO30</name>
                    <description>DIO30 interrupt</description>
                    <value>31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIO31</name>
                    <description>DIO31 interrupt</description>
                    <value>32</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
