exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>GPIOC_POLARITY31_16</name>
          <description>Polarity 31 to 16</description>
          <addressOffset>0x13A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIO16</name>
              <description>Enables and configures edge detection polarity for DIO16.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO17</name>
              <description>Enables and configures edge detection polarity for DIO17.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO18</name>
              <description>Enables and configures edge detection polarity for DIO18.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO19</name>
              <description>Enables and configures edge detection polarity for DIO19.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO20</name>
              <description>Enables and configures edge detection polarity for DIO20.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO21</name>
              <description>Enables and configures edge detection polarity for DIO21.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO22</name>
              <description>Enables and configures edge detection polarity for DIO22.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO23</name>
              <description>Enables and configures edge detection polarity for DIO23.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO24</name>
              <description>Enables and configures edge detection polarity for DIO24.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO25</name>
              <description>Enables and configures edge detection polarity for DIO25.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO26</name>
              <description>Enables and configures edge detection polarity for DIO26.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO27</name>
              <description>Enables and configures edge detection polarity for DIO27.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO28</name>
              <description>Enables and configures edge detection polarity for DIO28.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO29</name>
              <description>Enables and configures edge detection polarity for DIO29.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO30</name>
              <description>Enables and configures edge detection polarity for DIO30.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIO31</name>
              <description>Enables and configures edge detection polarity for DIO31.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Edge detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Detects rising edge of input event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Detects falling edge of input event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE_FALL</name>
                  <description>Detects both rising and falling edge of input event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOC_CTL</name>
          <description>FAST WAKE GLOBAL EN</description>
          <addressOffset>0x1400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FASTWAKEONLY</name>
              <description>FASTWAKEONLY for the global control of fastwake</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_GLOBAL_EN</name>
                  <description>The global control of fastwake is not enabled, per bit fast wake feature depends on FASTWAKE.DIN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLOBAL_EN</name>
                  <description>The global control of fastwake is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
