exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>GPIOC_SUB0CFG</name>
          <description>Subscriber 0 configuration</description>
          <addressOffset>0x1500</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>This bit is used to enable subscriber 0 event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Subscriber 0 event is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Subscriber 0 event is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPOLICY</name>
              <description>These bits configure the output policy for subscriber 0 event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Selected DIO pins are set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Selected DIO pins are cleared</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Selected DIO pins are toggled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INDEX</name>
              <description>Indicates the specific bit among lower 16 bits that is targeted by the subscriber action</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>specific bit targeted by the subscriber action is bit0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>specific bit targeted by the subscriber action is bit15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOC_FILTEREN15_0</name>
          <description>Filter Enable 15 to 0</description>
          <addressOffset>0x1508</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN0</name>
              <description>Programmable counter length of digital glitch filter for DIN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN1</name>
              <description>Programmable counter length of digital glitch filter for DIN1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN2</name>
              <description>Programmable counter length of digital glitch filter for DIN2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN3</name>
              <description>Programmable counter length of digital glitch filter for DIN3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN4</name>
              <description>Programmable counter length of digital glitch filter for DIN4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN5</name>
              <description>Programmable counter length of digital glitch filter for DIN5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN6</name>
              <description>Programmable counter length of digital glitch filter for DIN6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN7</name>
              <description>Programmable counter length of digital glitch filter for DIN7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN8</name>
              <description>Programmable counter length of digital glitch filter for DIN8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN9</name>
              <description>Programmable counter length of digital glitch filter for DIN9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN10</name>
              <description>Programmable counter length of digital glitch filter for DIN10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN11</name>
              <description>Programmable counter length of digital glitch filter for DIN11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN12</name>
              <description>Programmable counter length of digital glitch filter for DIN12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN13</name>
              <description>Programmable counter length of digital glitch filter for DIN13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN14</name>
              <description>Programmable counter length of digital glitch filter for DIN14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN15</name>
              <description>Programmable counter length of digital glitch filter for DIN15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
