exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>GPIOC_FILTEREN31_16</name>
          <description>Filter Enable 31 to 16</description>
          <addressOffset>0x150C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN16</name>
              <description>Programmable counter length of digital glitch filter for DIN16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN17</name>
              <description>Programmable counter length of digital glitch filter for DIN17</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN18</name>
              <description>Programmable counter length of digital glitch filter for DIN18</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN19</name>
              <description>Programmable counter length of digital glitch filter for DIN19</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN20</name>
              <description>Programmable counter length of digital glitch filter for DIN20</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN21</name>
              <description>Programmable counter length of digital glitch filter for DIN21</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN22</name>
              <description>Programmable counter length of digital glitch filter for DIN22</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN23</name>
              <description>Programmable counter length of digital glitch filter for DIN23</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN24</name>
              <description>Programmable counter length of digital glitch filter for DIN24</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN25</name>
              <description>Programmable counter length of digital glitch filter for DIN25</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN26</name>
              <description>Programmable counter length of digital glitch filter for DIN26</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN27</name>
              <description>Programmable counter length of digital glitch filter for DIN27</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN28</name>
              <description>Programmable counter length of digital glitch filter for DIN28</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN29</name>
              <description>Programmable counter length of digital glitch filter for DIN29</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN30</name>
              <description>Programmable counter length of digital glitch filter for DIN30</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIN31</name>
              <description>Programmable counter length of digital glitch filter for DIN31</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No additional filter beyond the CDC synchronization sample</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_CYCLE</name>
                  <description>1 ULPCLK minimum sample</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE_CYCLE</name>
                  <description>3 ULPCLK minimum sample</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_CYCLE</name>
                  <description>8 ULPCLK minimum sample</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
