exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>FLASHCTL_CMDDATA22</name>
          <description>Command Data Register 22</description>
          <addressOffset>0x1188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA23</name>
          <description>Command Data Register 23</description>
          <addressOffset>0x118C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA24</name>
          <description>Command Data Register 24</description>
          <addressOffset>0x1190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA25</name>
          <description>Command Data Register 25</description>
          <addressOffset>0x1194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA26</name>
          <description>Command Data Register 26</description>
          <addressOffset>0x1198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA27</name>
          <description>Command Data Register 27</description>
          <addressOffset>0x119C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA28</name>
          <description>Command Data Register 28</description>
          <addressOffset>0x11A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA29</name>
          <description>Command Data Register 29</description>
          <addressOffset>0x11A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA30</name>
          <description>Command Data Register 30</description>
          <addressOffset>0x11A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATA31</name>
          <description>Command Data Register 31</description>
          <addressOffset>0x11AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>A 32-bit data value is placed in this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC0</name>
          <description>Command Data Register ECC 0</description>
          <addressOffset>0x11B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC1</name>
          <description>Command Data Register ECC 1</description>
          <addressOffset>0x11B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC2</name>
          <description>Command Data Register ECC 2</description>
          <addressOffset>0x11B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC3</name>
          <description>Command Data Register ECC 3</description>
          <addressOffset>0x11BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC4</name>
          <description>Command Data Register ECC 4</description>
          <addressOffset>0x11C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC5</name>
          <description>Command Data Register ECC 5</description>
          <addressOffset>0x11C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC6</name>
          <description>Command Data Register ECC 6</description>
          <addressOffset>0x11C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDDATAECC7</name>
          <description>Command Data Register ECC 7</description>
          <addressOffset>0x11CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL0</name>
              <description>ECC data for bits 63:0 of the data is placed here.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VAL1</name>
              <description>ECC data for bits 127:64 of the data is placed here.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDWEPROTA</name>
          <description>Command Write Erase Protect A Register</description>
          <addressOffset>0x11D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the flash memory will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the flash memory will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the flash memory will be protected from program
		and erase.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDWEPROTB</name>
          <description>Command Write Erase Protect B Register</description>
          <addressOffset>0x11D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  A maximum of 256
sectors can be protected with this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDWEPROTC</name>
          <description>Command Write Erase Protect C Register</description>
          <addressOffset>0x11D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  Note that the sectors
protected with this register start at sector 256 in the flash, where the sectors
protected by the CMDWEPROTB register end.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDWEPROTNM</name>
          <description>Command Write Erase Protect Non-Main Register</description>
          <addressOffset>0x1210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the non-main region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the non-main region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the non-main will be protected from program
		and erase.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_CMDWEPROTTR</name>
          <description>Command Write Erase Protect Trim Register</description>
          <addressOffset>0x1214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Each bit protects 1 sector.

