exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>FLASHCTL_STATMODE</name>
          <description>Mode Status Register</description>
          <addressOffset>0x13DC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BANKNOTINRD</name>
              <description>Bank not in read mode.
Indicates which banks are not in READ mode.  There is 1 bit per bank.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK0</name>
                  <description>Bank 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK1</name>
                  <description>Bank 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK2</name>
                  <description>Bank 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK3</name>
                  <description>Bank 3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK4</name>
                  <description>Bank 4</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANKMODE</name>
              <description>Indicates mode of bank(s) that are not in READ mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG0</name>
                  <description>Read Margin 0 Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG1</name>
                  <description>Read Margin 1 Mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG0B</name>
                  <description>Read Margin 0B Mode</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMARG1B</name>
                  <description>Read Margin 1B Mode</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMVER</name>
                  <description>Program Verify Mode</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMSW</name>
                  <description>Program Single Word</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASEVER</name>
                  <description>Erase Verify Mode</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASESECT</name>
                  <description>Erase Sector</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGMMW</name>
                  <description>Program Multiple Word</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASEBNK</name>
                  <description>Erase Bank</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK2TRDY</name>
              <description>Bank 2T Ready.
Bank(s) are ready for 2T access.  This is accomplished when the pump has
fully driven power rails to the bank(s).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>Not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BANK1TRDY</name>
              <description>Bank 1T Ready.
Bank(s) are ready for 1T access.  This is accomplished when the bank and pump
have been trimmed.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>Not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_GBLINFO0</name>
          <description>Global Information Register 0</description>
          <addressOffset>0x13F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SECTORSIZE</name>
              <description>Sector size in bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEKB</name>
                  <description>Sector size is ONEKB</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOKB</name>
                  <description>Sector size is TWOKB</description>
                  <value>2048</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMBANKS</name>
              <description>Number of banks instantiated
Minimum:	1
Maximum:	5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_GBLINFO1</name>
          <description>Global Information Register 1</description>
          <addressOffset>0x13F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATAWIDTH</name>
              <description>Data width in bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W64BIT</name>
                  <description>Data width is 64 bits</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W128BIT</name>
                  <description>Data width is 128 bits</description>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCWIDTH</name>
              <description>ECC data width in bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W0BIT</name>
                  <description>ECC data width is 0.  ECC not used.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W8BIT</name>
                  <description>ECC data width is 8 bits</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W16BIT</name>
                  <description>ECC data width is 16 bits</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REDWIDTH</name>
              <description>Redundant data width in bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W0BIT</name>
                  <description>Redundant data width is 0.  Redundancy/Repair not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W2BIT</name>
                  <description>Redundant data width is 2 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W4BIT</name>
                  <description>Redundant data width is 4 bits</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_GBLINFO2</name>
          <description>Global Information Register 2</description>
          <addressOffset>0x13F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATAREGISTERS</name>
              <description>Number of data registers present.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK0INFO0</name>
          <description>Bank Information Register 0 for Bank 0</description>
          <addressOffset>0x1400</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAINSIZE</name>
              <description>Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [MAINSIZE]</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [MAINSIZE]</description>
                  <value>512</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK0INFO1</name>
          <description>Bank Information Register 1 for Bank 0</description>
          <addressOffset>0x1404</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NONMAINSIZE</name>
              <description>Non-main region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [NONMAINSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [NONMAINSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMSIZE</name>
              <description>Trim region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [TRIMSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [TRIMSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENGRSIZE</name>
              <description>Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [ENGRSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [ENGRSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK1INFO0</name>
          <description>Bank Information Register 0 for Bank 1</description>
          <addressOffset>0x1410</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAINSIZE</name>
              <description>Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [MAINSIZE]</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [MAINSIZE]</description>
                  <value>512</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK1INFO1</name>
          <description>Bank Information Register 1 for Bank 1</description>
          <addressOffset>0x1414</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NONMAINSIZE</name>
              <description>Non-main region size in sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [NONMAINSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [NONMAINSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMSIZE</name>
              <description>Trim region size in sectors</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [TRIMSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [TRIMSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENGRSIZE</name>
              <description>Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [ENGRSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [ENGRSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK2INFO0</name>
          <description>Bank Information Register 0 for Bank 2</description>
          <addressOffset>0x1420</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAINSIZE</name>
              <description>Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [MAINSIZE]</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [MAINSIZE]</description>
                  <value>512</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK2INFO1</name>
          <description>Bank Information Register 1 for Bank 2</description>
          <addressOffset>0x1424</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NONMAINSIZE</name>
              <description>Non-main region size in sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [NONMAINSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [NONMAINSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMSIZE</name>
              <description>Trim region size in sectors</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [TRIMSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [TRIMSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENGRSIZE</name>
              <description>Engr region size in sectors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [ENGRSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [ENGRSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK3INFO0</name>
          <description>Bank Information Register 0 for Bank 3</description>
          <addressOffset>0x1430</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAINSIZE</name>
              <description>Main region size in sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [MAINSIZE]</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [MAINSIZE]</description>
                  <value>512</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
