exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>FLASHCTL_BANK3INFO1</name>
          <description>Bank Information Register 1 for Bank 3</description>
          <addressOffset>0x1434</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NONMAINSIZE</name>
              <description>Non-main region size in sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [NONMAINSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [NONMAINSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMSIZE</name>
              <description>Trim region size in sectors</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [TRIMSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [TRIMSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENGRSIZE</name>
              <description>Engr region size in sectors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [ENGRSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [ENGRSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK4INFO0</name>
          <description>Bank Information Register 0 for Bank 4</description>
          <addressOffset>0x1440</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAINSIZE</name>
              <description>Main region size in sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [MAINSIZE]</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [MAINSIZE]</description>
                  <value>512</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCTL_BANK4INFO1</name>
          <description>Bank Information Register 1 for Bank 4</description>
          <addressOffset>0x1444</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NONMAINSIZE</name>
              <description>Non-main region size in sectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [NONMAINSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [NONMAINSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMSIZE</name>
              <description>Trim region size in sectors</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [TRIMSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [TRIMSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENGRSIZE</name>
              <description>Engr region size in sectors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINSECTORS</name>
                  <description>Minimum value of [ENGRSIZE]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXSECTORS</name>
                  <description>Maximum value of [ENGRSIZE]</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
