exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AESADV</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>AESADV</groupName>
      <baseAddress>0x40442000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AESADV</name>
        <value>28</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimArrayIndex/>
          <name>AESADV_GPRCM[%s]</name>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>AESADV_PWREN</name>
            <description>Power enable</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the power</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable Power</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable Power</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for AESADV power enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCK</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock pwren</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock pwren</description>
                    <value>38</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AESADV_RSTCTL</name>
            <description>Reset Control</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RESETSTKYCLR</name>
                <description>Clear the RESETSTKY bit in the STAT register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear reset sticky bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETASSERT</name>
                <description>Assert reset to the peripheral</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ASSERT</name>
                    <description>Assert reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY_UNLOCK</name>
                <description>Key unlock for AESADV reset control</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <enumeratedValues>
                  <name>KEY_UNLOCKW</name>
                  <enumeratedValue>
                    <name>LOCK</name>
                    <description>Lock reset</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNLOCK</name>
                    <description>Unlock reset</description>
                    <value>177</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AESADV_STAT</name>
            <description>Status Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>RESETSTKY</name>
                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORES</name>
                    <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>The peripheral was reset since the last bit clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>AESADV_PDBGCTL</name>
          <description>Peripheral Debug Control</description>
          <addressOffset>0x1018</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FREE</name>
              <description>Free run control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>The peripheral ignores the state of the Core Halted input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>AESADV_INT_EVENT0[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>AESADV_INT_EVENT0_IIDX</name>
            <description>Interrupt Index Register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OUTPUTRDY</name>
                    <description>This indicates that the core has an output available to be read out. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INPUTRDY</name>
                    <description>This indicates that the engine can take new input. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SAVEDCNTXTRDY</name>
                    <description>This bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the CPU to retrieve. This bit is only asserted if the save_context bit is set to 1b. The bit is mutually exclusive with the context_ready bit.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTXTRDY</name>
                    <description>This bit indicates that the context data registers can be overwritten, and the CPU is permitted to write new context.</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AESADV_INT_EVENT0_IMASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>OUTPUTRDY</name>
                <description>This indicates that the core has an output available to be read out. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPUTRDY</name>
                <description>This indicates that the engine can take new input. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAVEDCNTXTRDY</name>
                <description>This bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the CPU to retrieve. This bit is only asserted if the save_context bit is set to 1b. The bit is mutually exclusive with the context_ready bit.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CNTXTRDY</name>
                <description>This bit indicates that the context data registers can be overwritten, and the CPU is permitted to write next context.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AESADV_INT_EVENT0_RIS</name>
            <description>Raw interrupt status</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>OUTPUTRDY</name>
                <description>This indicates that the core has an output available to be read out. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt did not occur</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt occured</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPUTRDY</name>
                <description>This indicates that the engine can take new input. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAVEDCNTXTRDY</name>
                <description>This bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the CPU to retrieve. This bit is only asserted if the save_context bit is set to 1b. The bit is mutually exclusive with the context_ready bit.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CNTXTRDY</name>
                <description>This bit indicates that the context data registers can be overwritten, and the CPU is permitted to write next context.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AESADV_INT_EVENT0_MIS</name>
            <description>Masked interrupt status</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>OUTPUTRDY</name>
                <description>This indicates that the core has an output available to be read out. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Interrupt did not occur</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Interrupt occured</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INPUTRDY</name>
                <description>This indicates that the engine can take new input. This should not be used if DMA handshake is used (AES_DMA_HS.DMA_DATA_ACK set to 1)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SAVEDCNTXTRDY</name>
                <description>This bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the CPU to retrieve. This bit is only asserted if the save_context bit is set to 1b. The bit is mutually exclusive with the context_ready bit.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CNTXTRDY</name>
                <description>This bit indicates that the context data registers can be overwritten, and the CPU is permitted to write next context.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
