exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>AESADV_TAG1</name>
          <description>Hash result</description>
          <addressOffset>0x1174</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>AESADV_TAG2</name>
          <description>Hash result</description>
          <addressOffset>0x1178</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>AESADV_TAG3</name>
          <description>Hash result (MSW)</description>
          <addressOffset>0x117C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>AESADV_STATUS</name>
          <description>Status</description>
          <addressOffset>0x1180</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>KEYWR</name>
              <description>Key write status. 0 - user write to KEY register is allowed. 1 - user write to KEY register is ignored.
In order to allow user write, perform a module reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>User write to KEY MMR is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>User write to KEY MMR is disabled. Writing has no effect.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AESADV_DATA_IN</name>
          <description>Data in alias register</description>
          <addressOffset>0x1184</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
        </register>
        <register>
          <name>AESADV_DATA_OUT</name>
          <description>Data out alias register</description>
          <addressOffset>0x1188</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
        </register>
        <register>
          <name>AESADV_FORCE_IN_AV</name>
          <description>Data control register for input data</description>
          <addressOffset>0x11D0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>AESADV_CCM_ALN_WRD</name>
          <description>AES-CCM AAD alignment data word</description>
          <addressOffset>0x11D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>AESADV_BLK_CNT0</name>
          <description>Internal block counter (LSW)</description>
          <addressOffset>0x11D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>AESADV_BLK_CNT1</name>
          <description>Internal block counter (MSW)</description>
          <addressOffset>0x11DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Internal block counter for AES GCM and CCM operations.
These bits read the block count value that represents the number of blocks to go. This value is valid with saved_context_ready after a request for an intermediate GCM/CCM digest.
Writing these registers will restore the internal block counter to the programmed value. This only needs to be done to prepare the engine to continue processing of an interrupted GCM or CCM operation.
Also refer to the get_digest and gcm_ccm_continue bits in AES_CTRL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESADV_DMA_HS</name>
          <description>Control register for DMA handshaking</description>
          <addressOffset>0x11F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_DATA_ACK</name>
              <description>When this bit is 0b, input and output data acknowledge is I/O register based, as specified in the description of the AES_DATA_IN_n / AES_DATA_OUT_n registers.
When this bit is 1b, input and ouput data acknowledge is based on DMA handshake signals.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_DISABLE</name>
                  <description>Disable DMA based data handshake</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_ENABLE</name>
                  <description>Enables DMA based handshake</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRCP0</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>CRCP</groupName>
      <baseAddress>0x40440000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimArrayIndex/>
          <name>CRCP0_GPRCM[%s]</name>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>CRCP0_PWREN</name>
            <description>Power enable</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the power</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disable Power</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enable Power</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CRCP0_RSTCTL</name>
            <description>Reset Control</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RESETSTKYCLR</name>
                <description>Clear the RESETSTKY bit in the STAT register</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear reset sticky bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESETASSERT</name>
                <description>Assert reset to the peripheral</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOP</name>
                    <description>Writing 0 has no effect</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ASSERT</name>
                    <description>Assert reset</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CRCP0_STAT</name>
            <description>Status Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>RESETSTKY</name>
                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORES</name>
                    <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>The peripheral was reset since the last bit clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CRCP0_DESC</name>
          <description>Module Description</description>
          <addressOffset>0x10FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MINREV</name>
              <description>Minor rev of the IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>Major rev of the IP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INSTNUM</name>
              <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FEATUREVER</name>
              <description>Feature Set for the module *instance*</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MODULEID</name>
              <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCP0_CRCCTRL</name>
          <description>CRC Control Register</description>
          <addressOffset>0x1100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>POLYSIZE</name>
              <description>This bit indicates which CRC calculation is performed by the generator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC32</name>
                  <description>CRC-32 ISO-3309 calulation is performed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC16</name>
                  <description>CRC-16 CCITT is performed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITREVERSE</name>
              <description>CRC Bit Input and output Reverse. This bit indictes that the bit order of each input byte used for the CRC calculation is reversed before it is passed to the generator, and that the bit order of the calculated CRC is be reversed when read from CRC_RESULT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_REVERSED</name>
                  <description>Bit order is not reversed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REVERSED</name>
                  <description>Bit order is reversed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT_ENDIANNESS</name>
              <description>CRC Endian. This bit indicates the byte order within a word or half word of input data.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LITTLE_ENDIAN</name>
                  <description>LSB is lowest memory address and first to be processed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIG_ENDIAN</name>
                  <description>LSB is highest memory address and last to be processed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPUT_BYTESWAP</name>
              <description>CRC Output Byteswap Enable. This bit controls whether the output is byte-swapped upon a read of the CRCOUT register.
If CRCOUT is accessed as a half-word, and the OUTPUT_BYTESWAP is set to to 1, then the two bytes in the 16-bit access are swapped and returned.
B1 is returned as B0
B0 is returned as B1

