exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>TIMG0_INT_EVENT[%s]</name>
          <addressOffset>0x1020</addressOffset>
          <register>
            <name>TIMG0_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No interrupt pending</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Z</name>
                    <description>Interrupt Source: Zero event</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L</name>
                    <description>REPLACE THIS WITH AN ACTUAL IRQ NAME</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD0</name>
                    <description>Interrupt Source: Capture or compare down event (CCD0)</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD1</name>
                    <description>Interrupt Source: Capture or compare down event (CCD1)</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD2</name>
                    <description>Interrupt Source: Capture or compare down event (CCD2)</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD3</name>
                    <description>Interrupt Source: Capture or compare down event (CCD3)</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU0</name>
                    <description>Interrupt Source: Capture or compare up event (CCU0)</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU1</name>
                    <description>Interrupt Source: Capture or compare up event (CCU1)</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU2</name>
                    <description>Interrupt Source: Capture or compare up event (CCU2)</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU3</name>
                    <description>Interrupt Source: Capture or compare up event (CCU3)</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD4</name>
                    <description>Interrupt Source: Compare down event (CCD4)</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD5</name>
                    <description>Interrupt Source: Compare down event (CCD5)</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU4</name>
                    <description>Interrupt Source: Compare down event (CCU4)</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU5</name>
                    <description>Interrupt Source: Compare down event (CCU5)</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>F</name>
                    <description>Interrupt Source: Fault Event generated an interrupt.</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TOV</name>
                    <description>Interrupt Source: Trigger overflow</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPC</name>
                    <description>Repeat Counter Zero</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DC</name>
                    <description>Interrupt Source: Direction Change</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QEIERR</name>
                    <description>QEI Incorrect state transition error</description>
                    <value>29</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_IMASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>Z</name>
                <description>Zero Event mask</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Disable Event</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Enable Event</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L</name>
                <description>Load Event mask</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD0</name>
                <description>Capture or Compare DN event mask CCP0</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD1</name>
                <description>Capture or Compare DN event mask CCP1</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU0</name>
                <description>Capture or Compare UP event mask CCP0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU1</name>
                <description>Capture or Compare UP event mask CCP1</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear Interrupt Mask</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set Interrupt Mask</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TOV</name>
                <description>Trigger Overflow Event mask</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Disable Event</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Enable Event</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_RIS</name>
            <description>Raw interrupt status</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Z</name>
                <description>Zero event generated an interrupt.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L</name>
                <description>Load event generated an interrupt.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD0</name>
                <description>Capture or compare down event generated an interrupt CCP0</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD1</name>
                <description>Capture or compare down event generated an interrupt CCP1</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU0</name>
                <description>Capture or compare up event generated an interrupt CCP0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU1</name>
                <description>Capture or compare up event generated an interrupt CCP1</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TOV</name>
                <description>Trigger overflow</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_MIS</name>
            <description>Masked interrupt status</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>Z</name>
                <description>Zero event generated an interrupt.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L</name>
                <description>Load event generated an interrupt.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD0</name>
                <description>Capture or compare down event generated an interrupt CCP0</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD1</name>
                <description>Capture or compare down event generated an interrupt CCP1</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU0</name>
                <description>Capture or compare up event generated an interrupt CCP0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU1</name>
                <description>Capture or compare up event generated an interrupt CCP1</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TOV</name>
                <description>Trigger overflow</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Cleared</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
