exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <name>TIMG0_ISET</name>
            <description>Interrupt set</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>Z</name>
                <description>Zero event SET</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L</name>
                <description>Load event SET</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD0</name>
                <description>Capture or compare down event SET</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD1</name>
                <description>Capture or compare down event SET</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU0</name>
                <description>Capture or compare up event SET</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU1</name>
                <description>Capture or compare up event SET</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TOV</name>
                <description>Trigger Overflow event SET</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Event Set</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_ICLR</name>
            <description>Interrupt clear</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>Z</name>
                <description>Zero event CLEAR</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L</name>
                <description>Load event CLEAR</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD0</name>
                <description>Capture or compare down event CLEAR</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCD1</name>
                <description>Capture or compare down event CLEAR</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU0</name>
                <description>Capture or compare up event CLEAR</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCU1</name>
                <description>Capture or compare up event CLEAR</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TOV</name>
                <description>Trigger Overflow event CLEAR</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_EFFECT</name>
                    <description>Writing 0 has no effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Event Clear</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TIMG0_EVT_MODE</name>
          <description>Event Mode</description>
          <addressOffset>0x10E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000029</resetValue>
          <fields>
            <field>
              <name>EVT0_CFG</name>
              <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The interrupt or event line is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVT1_CFG</name>
              <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][1]</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The interrupt or event line is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVT2_CFG</name>
              <description>Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][1]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The interrupt or event line is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <description>The interrupt or event line is in software mode. Software must clear the RIS.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <description>The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMG0_DESC</name>
          <description>Module Description</description>
          <addressOffset>0x10FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MINREV</name>
              <description>Minor rev of the IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>Major rev of the IP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INSTNUM</name>
              <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FEATUREVER</name>
              <description>Feature Set for the module *instance*</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MODULEID</name>
              <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimArrayIndex/>
          <name>TIMG0_COMMONREGS[%s]</name>
          <addressOffset>0x1100</addressOffset>
          <register>
            <name>TIMG0_CCPD</name>
            <description>CCP Direction</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>C0CCP0</name>
                <description>Counter CCP0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INPUT</name>
                    <description>Input</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OUTPUT</name>
                    <description>Output</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>C0CCP1</name>
                <description>Counter CCP1</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INPUT</name>
                    <description>Input</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OUTPUT</name>
                    <description>Output</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_ODIS</name>
            <description>Output Disable</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>C0CCP0</name>
                <description>Counter CCP0 Disable Mask
Defines whether CCP0 of Counter n is forced low or not</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CCP_OUTPUT_OCTL</name>
                    <description>Output function as selected by the OCTL register CCPO field are provided to occpout[0].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_OUTPUT_LOW</name>
                    <description>CCP output occpout[0] is forced low.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>C0CCP1</name>
                <description>Counter CCP1 Disable Mask
Defines whether CCP0 of Counter n is forced low or not</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CCP_OUTPUT_OCTL</name>
                    <description>Output function as selected by the OCTL register CCPO field are provided to occpout[1].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_OUTPUT_LOW</name>
                    <description>CCP output occpout[1] is forced low.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_CCLKCTL</name>
            <description>Counter Clock Control Register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CLKEN</name>
                <description>Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Clock is disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Clock is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_CPS</name>
            <description>Clock Prescale Register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>PCNT</name>
                <description>Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_CPSV</name>
            <description>Clock prescale count status register</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>CPSVAL</name>
                <description>Current Prescale Count Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG0_CTTRIGCTL</name>
            <description>Timer Cross Trigger Control Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CTEN</name>
                <description>Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

