exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <name>TIMG8_CCLKCTL</name>
            <description>Counter Clock Control Register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CLKEN</name>
                <description>Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Clock is disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Clock is enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG8_CPS</name>
            <description>Clock Prescale Register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>PCNT</name>
                <description>Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG8_CPSV</name>
            <description>Clock prescale count status register</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>CPSVAL</name>
                <description>Current Prescale Count Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG8_CTTRIGCTL</name>
            <description>Timer Cross Trigger Control Register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CTEN</name>
                <description>Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Cross trigger generation disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Cross trigger generation enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EVTCTEN</name>
                <description>Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers. Refer  Figure 8 Cross Trigger Generation Path</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Cross trigger generation disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Cross trigger generation enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EVTCTTRIGSEL</name>
                <description>Used to Select the subscriber port that should be used for input cross trigger. Refer  Figure 8 Cross Trigger Generation Path</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FSUB0</name>
                    <description>Use FSUB0 as cross trigger source.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FSUB1</name>
                    <description>Use FSUB1 as cross trigger source.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Z</name>
                    <description>Use Zero event  as cross trigger source.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>L</name>
                    <description>Use Load event as cross trigger source.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD0</name>
                    <description>Use CCD0 event  as cross trigger source.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD1</name>
                    <description>Use CCD1 event  as cross trigger source.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD2</name>
                    <description>Use CCD2 event  as cross trigger source.</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCD3</name>
                    <description>Use CCD3 event  as cross trigger source.</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU0</name>
                    <description>Use CCU0 event  as cross trigger source.</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU1</name>
                    <description>Use CCU1 event  as cross trigger source.</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU2</name>
                    <description>Use CCU2 event  as cross trigger source.</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCU3</name>
                    <description>Use CCU3 event  as cross trigger source.</description>
                    <value>11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG8_CTTRIG</name>
            <description>Timer Cross Trigger Register</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>TRIG</name>
                <description>Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Cross trigger generation disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GENERATE</name>
                    <description>Generate Cross trigger pulse</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0xC0</dimIncrement>
          <dimArrayIndex/>
          <name>TIMG8_COUNTERREGS[%s]</name>
          <addressOffset>0x1800</addressOffset>
          <register>
            <name>TIMG8_CTR</name>
            <description>Counter Register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCTR</name>
                <description>Current Counter value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMG8_CTRCTL</name>
            <description>Counter Control Register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000FF80</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Counter Enable.  This bit allows the timer to advance  This bit is automatically cleared if REPEAT=0 (do not automatically reload) and the counter value equals zero.  CPU Write: A register write that sets the EN bit, the counter value is set per the CVAE value. Hardware: This bit may also be set as the result of an LCOND or ZCOND condition being met and the counter value changed to the load value or zero value, respectively.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REPEAT</name>
                <description>Repeat.  The repeat bit controls whether the counter continues to advance following a zero event, or the exiting of a debug or fault condition.  If counting down, a zero event is followed by a load at the next advance condition. If counting up-down, a zero event is followed by an advance event (+1). The intent of encoding 3 is that if the debug condition is in effect, the generation of the load pulse is deferred until the debug condition is over. This allows the counter to reach zero before counting is suspended.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>REPEAT_0</name>
                    <description>Does not automatically advance following a zero event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPEAT_1</name>
                    <description>Continues to advance following a zero event.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPEAT_2</name>
                    <description>Reserved</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPEAT_3</name>
                    <description>Continues to advance following a zero event if the debug mode is not in effect, or following the release of the debug mode.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPEAT_4</name>
                    <description>Reserved</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CM</name>
                <description>Count Mode</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DOWN</name>
                    <description>Down</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UP_DOWN</name>
                    <description>Up/Down</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UP</name>
                    <description>Counter counts up.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CVAE</name>
                <description>Counter Value After Enable.  This field specifies the initialization condition of the counter when the EN bit is changed from 0 to 1 by a write to the CTRCTL register. Note that an external event can also cause the EN bit to go active.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LDVAL</name>
                    <description>The counter is set to the LOAD register value</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NOCHANGE</name>
                    <description>The counter value is unchanged from its current value which could have been initialized by software</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZEROVAL</name>
                    <description>The counter is set to zero</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DRB</name>
                <description>Debug Resume Behavior This bit specifies what the device does following the release/exit of debug mode.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESUME</name>
                    <description>Resume counting</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CVAE_ACTION</name>
                    <description>Perform the action as specified by the CVAE field.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLC</name>
                <description>Counter Load Control.  This field specifies what controls the counter operation with respect to setting the counter to the LD register value. 

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CCCTL0_LCOND</name>
                    <description>CCCTL_0 LCOND</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL1_LCOND</name>
                    <description>CCCTL_1 LCOND</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL2_LCOND</name>
                    <description>CCCTL_2 LCOND This value exists when there are 4 channels.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL3_LCOND</name>
                    <description>CCCTL_3 LCOND This value exists when there are 4 channels.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QEI_2INP</name>
                    <description>Controlled by 2 input QEI mode. This value exists when gptimer support QEI feature.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QEI_3INP</name>
                    <description>Controlled by 3 input QEI mode.  This value exists when gptimer support QEI feature.</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CAC</name>
                <description>Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CCCTL0_ACOND</name>
                    <description>CCCTL_0 ACOND</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL1_ACOND</name>
                    <description>CCCTL_1 ACOND</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL2_ACOND</name>
                    <description>CCCTL_2 ACOND This value exists when there are 4 channels.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL3_ACOND</name>
                    <description>CCCTL_3 ACOND This value exists when there are 4 channels.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QEI_2INP</name>
                    <description>Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QEI_3INP</name>
                    <description>Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature.</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CZC</name>
                <description>Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CCCTL0_ZCOND</name>
                    <description>CCCTL_0 ZCOND</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL1_ZCOND</name>
                    <description>CCCTL_1 ZCOND</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL2_ZCOND</name>
                    <description>CCCTL_2 ZCOND This value exists when there are 4 channels.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCTL3_ZCOND</name>
                    <description>CCCTL_3 ZCOND This value exists when there are 4 channels.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QEI_2INP</name>
                    <description>Controlled by 2-input QEI mode  This value exists when gptimer support QEI feature.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QEI_3INP</name>
                    <description>Controlled by 3-input QEI mode  This value exists when gptimer support QEI feature.</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
