exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>TIMA0_OCTL_01[%s]</name>
            <description>CCP Output Control Registers</description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCPOINV</name>
                <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOINV</name>
                    <description>No inversion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INV</name>
                    <description>Invert</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCPIV</name>
                <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOW</name>
                    <description>Low</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGH</name>
                    <description>High</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCPO</name>
                <description>CCP Output Source</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FUNCVAL</name>
                    <description>Signal generator value (for example, PWM, triggered PWM)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOAD</name>
                    <description>Load condition</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CMPVAL</name>
                    <description>Compare value = counter condition</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO</name>
                    <description>Zero condition</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAPCOND</name>
                    <description>Capture condition</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FAULTCOND</name>
                    <description>Fault Condition</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC0_MIRROR_ALL</name>
                    <description>Mirror CCP of first capture and compare register in counter group</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC1_MIRROR_ALL</name>
                    <description>Mirror CCP of second capture and compare register in counter group</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DEADBAND</name>
                    <description>Deadband Inserted Output</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTDIR</name>
                    <description>Counter direction</description>
                    <value>13</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>TIMA0_OCTL_23[%s]</name>
            <description>CCP Output Control Registers</description>
            <addressOffset>0x58</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCPOINV</name>
                <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOINV</name>
                    <description>No inversion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INV</name>
                    <description>Invert</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCPIV</name>
                <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOW</name>
                    <description>Low</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGH</name>
                    <description>High</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCPO</name>
                <description>CCP Output Source</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FUNCVAL</name>
                    <description>Signal generator value (for example, PWM, triggered PWM)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOAD</name>
                    <description>Load condition</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CMPVAL</name>
                    <description>Compare value = counter condition</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO</name>
                    <description>Zero condition</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAPCOND</name>
                    <description>Capture condition</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FAULTCOND</name>
                    <description>Fault Condition</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC0_MIRROR_ALL</name>
                    <description>Mirror CCP of first capture and compare register in counter group</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC1_MIRROR_ALL</name>
                    <description>Mirror CCP of second capture and compare register in counter group</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DEADBAND</name>
                    <description>Deadband Inserted Output</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTDIR</name>
                    <description>Counter direction</description>
                    <value>13</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>TIMA0_CCACT_01[%s]</name>
            <description>Capture or Compare Action Registers</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ZACT</name>
                <description>CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LACT</name>
                <description>CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CDACT</name>
                <description>CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CUACT</name>
                <description>CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CC2DACT</name>
                <description>CCP Output Action on CC2D event.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CC2UACT</name>
                <description>CCP Output Action on CC2U event.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FENACT</name>
                <description>CCP Output Action on Fault Entry
This field describes the resulting action of the signal generator upon detecting a fault.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGHZ</name>
                    <description>CCP output value is tristated</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FEXACT</name>
                <description>CCP Output Action on Fault Exit
This field describes the resulting action of the signal generator upon exiting the fault condition.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGHZ</name>
                    <description>CCP output value is tristated</description>
                    <value>4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWFRCACT</name>
                <description>CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWFRCACT_CMPL</name>
                <description>CCP_CMPL Output Action on Software Force Output

This field describes the resulting action of software force.

