exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <name>TIMA0_FCTL</name>
            <description>Fault Control Register</description>
            <addressOffset>0xD0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>FIEN</name>
                <description>Fault Input Enable
This bit enables the input for fault detection.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Fault Input Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Fault Input Enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FI</name>
                <description>Fault Input
Specifies whether the overall fault condition is dependent on the sensed fault pin.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INDEPENDENT</name>
                    <description>Overall Fault condition is not dependent on sensed input.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DEPENDENT</name>
                    <description>Overall Fault condition is dependent on sensed input.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TFIM</name>
                <description>Trigger Fault Input Mask
Specifies whether the selected trigger participates as a fault input. If enabled and the trigger asserts, the trigger is treated as a fault.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Selected trigger does not participate in fault condition generation</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Selected trigger participates in fault condition generation</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FL</name>
                <description>Fault Latch mode
Specifies whether the fault condition is latched and configures the latch clear conditions.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_LATCH</name>
                    <description>Overall fault condition is not dependent on the F bit in RIS</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATCH_SW_CLR</name>
                    <description>Overall fault condition is dependent on the F bit in RIS</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATCH_Z_CLR</name>
                    <description>Fault condition is latched. Fault condition is cleared on a zero event if the fault input is 0.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATCH_LD_CLR</name>
                    <description>Fault condition is latched. Fault condition is cleared on a load event if the fault input is 0.</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FSENAC0</name>
                <description>Specifies whether the analog comparator0 fault sense is high or low active</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOWCTIVE</name>
                    <description>Fault Input is active low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGHACTIVE</name>
                    <description>Fault Input is active high.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FSENAC1</name>
                <description>Specifies whether the analog comparator1 fault sense is high or low active</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOWCTIVE</name>
                    <description>Fault Input is active low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGHACTIVE</name>
                    <description>Fault Input is active high.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FSENAC2</name>
                <description>Specifies whether the analog comparator2 fault sense is high or low active</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOWCTIVE</name>
                    <description>Fault Input is active low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGHACTIVE</name>
                    <description>Fault Input is active high.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FSENEXT0</name>
                <description>Specifies whether the external fault pin0 sense is high or low active</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOWCTIVE</name>
                    <description>Fault Input is active low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGHACTIVE</name>
                    <description>Fault Input is active high.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FSENEXT1</name>
                <description>Specifies whether the external fault pin1 fault sense is high or low active</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOWCTIVE</name>
                    <description>Fault Input is active low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGHACTIVE</name>
                    <description>Fault Input is active high.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FSENEXT2</name>
                <description>Specifies whether the external fault pin3 fault sense is high or low active</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOWCTIVE</name>
                    <description>Fault Input is active low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGHACTIVE</name>
                    <description>Fault Input is active high.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMA0_FIFCTL</name>
            <description>Fault input Filter control register</description>
            <addressOffset>0xD4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>FP</name>
                <description>Filter Period
This field specifies the sample period for the input filter.  I.e. The input is sampled for FP timer clocks during filtering.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PER_3</name>
                    <description>Filter Period 3</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PER_5</name>
                    <description>Filter Period 5</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PER_8</name>
                    <description>Filter Period 8</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CPV</name>
                <description>Consecutive Period/Voting Select
This bit controls whether the input filter uses a stricter consecutive period count or majority voting.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CONSEC_PER</name>
                    <description>Consecutive Periods. The input must be at a specific logic level for the period defined by FP before it is passed to the filter output.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VOTING</name>
                    <description>Voting. The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FILTEN</name>
                <description>Filter Enable
This bit controls whether the input is filtered by the input filter or bypasses to go directly to the optional pre-scale filter and then to the edge detect.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BYPASS</name>
                    <description>Bypass</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FILTERED</name>
                    <description>Filtered.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
