exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x2C</dimIncrement>
          <dimArrayIndex/>
          <name>DMA_GEN_EVENT[%s]</name>
          <addressOffset>0x1050</addressOffset>
          <register>
            <name>DMA_GEN_EVENT_IIDX</name>
            <description>Interrupt index</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STAT</name>
                <description>Interrupt index status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NO_INTR</name>
                    <description>No bit is set means there is no pending interrupt request</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH0</name>
                    <description>DMA Channel 0 size counter reached zero (DMASZ=0).</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH1</name>
                    <description>DMA Channel 1 size counter reached zero (DMASZ=0).</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH2</name>
                    <description>DMA Channel 2 size counter reached zero (DMASZ=0).</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH3</name>
                    <description>DMA Channel 3 size counter reached zero (DMASZ=0).</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH4</name>
                    <description>DMA Channel 4 size counter reached zero (DMASZ=0).</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH5</name>
                    <description>DMA Channel 5 size counter reached zero (DMASZ=0).</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH6</name>
                    <description>DMA Channel 6 size counter reached zero (DMASZ=0).</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH7</name>
                    <description>DMA Channel 7 size counter reached zero (DMASZ=0).</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH8</name>
                    <description>DMA Channel 8 size counter reached zero (DMASZ=0).</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH9</name>
                    <description>DMA Channel 9 size counter reached zero (DMASZ=0).</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH10</name>
                    <description>DMA Channel 10 size counter reached zero (DMASZ=0).</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH11</name>
                    <description>DMA Channel 11 size counter reached zero (DMASZ=0).</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH12</name>
                    <description>DMA Channel 12 size counter reached zero (DMASZ=0).</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH13</name>
                    <description>DMA Channel 13 size counter reached zero (DMASZ=0).</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH14</name>
                    <description>DMA Channel 14 size counter reached zero (DMASZ=0).</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DMACH15</name>
                    <description>DMA Channel 15 size counter reached zero (DMASZ=0).</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH0</name>
                    <description>PRE-IRQ event for DMA Channel 0.</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH1</name>
                    <description>PRE-IRQ event for DMA Channel 1.</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH2</name>
                    <description>PRE-IRQ event for DMA Channel 2.</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH3</name>
                    <description>PRE-IRQ event for DMA Channel 3.</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH4</name>
                    <description>PRE-IRQ event for DMA Channel 4.</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH5</name>
                    <description>PRE-IRQ event for DMA Channel 5.</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH6</name>
                    <description>PRE-IRQ event for DMA Channel 6.</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQCH7</name>
                    <description>PRE-IRQ event for DMA Channel 7.</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDRERR</name>
                    <description>DMA address error, SRC address not reachable.</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATAERR</name>
                    <description>DMA data error, SRC data might be corrupted (PAR or ECC error).</description>
                    <value>26</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DMA_GEN_EVENT_IMASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMACH0</name>
                <description>DMA Channel 0 interrupt signal. Size counter reached zero (DMASZ=0).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMACH1</name>
                <description>DMA Channel 1 interrupt signal. Size counter reached zero (DMASZ=0).</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMACH2</name>
                <description>DMA Channel 2 interrupt signal. Size counter reached zero (DMASZ=0).</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMACH3</name>
                <description>DMA Channel 3 interrupt signal. Size counter reached zero (DMASZ=0).</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMACH4</name>
                <description>DMA Channel 4 interrupt signal. Size counter reached zero (DMASZ=0).</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMACH5</name>
                <description>DMA Channel 5 interrupt signal. Size counter reached zero (DMASZ=0).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMACH6</name>
                <description>DMA Channel 6 interrupt signal. Size counter reached zero (DMASZ=0).</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PREIRQCH0</name>
                <description>Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PREIRQCH1</name>
                <description>Pre-IRQ for Channel 1. Size counter reached Pre-IRQ threshold.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PREIRQCH2</name>
                <description>Pre-IRQ for Channel 2. Size counter reached Pre-IRQ threshold.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADDRERR</name>
                <description>DMA address error, SRC address not reachable.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DATAERR</name>
                <description>DMA data error, SRC data might be corrupted (PAR or ECC error).</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLR</name>
                    <description>Clear interrupt mask bit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SET</name>
                    <description>Set interrupt mask bit</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
