exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
Note: The repeat-single (2h) and repeat-block (3h) transfer are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration only the values for single (0h) and block (1h) transfer can be set.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SINGLE</name>
                    <description>Single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated and the DMAEN is cleared.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BLOCK</name>
                    <description>Block transfer. Each trigger transfers the complete block defined in DMASZ. After the transfer is complete an event can be generated and the DMAEN is cleared.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RPTSNGL</name>
                    <description>Repeated single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RPTBLCK</name>
                    <description>Repeated block transfer. Each trigger transfers the complete block defined in DMASZ. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled.</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMAEM</name>
                <description>DMA extended mode

Note: The extended transfer modes are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration this register is a read-only register and reads 0x0.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal mode is related to transfers from SRC to DST</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FILLMODE</name>
                    <description>Fill mode will copy the SA register content as data to DA</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TABLEMODE</name>
                    <description>Table mode will read an address and data value from SA and write the data to address</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMAPREIRQ</name>
                <description>Enable an early IRQ event. This can help software to react quicker to and DMA done event or allows some additional configuration before the channel is complete. 

Note: This register is only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC configuration this register is a read only value and always reads as 0x0.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PREIRQ_DISABLE</name>
                    <description>Pre-IRQ event disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQ_1</name>
                    <description>Issure Pre-IRQ event when DMASZ=1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQ_2</name>
                    <description>Issure Pre-IRQ event when DMASZ=2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQ_4</name>
                    <description>Issure Pre-IRQ event when DMASZ=4</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQ_8</name>
                    <description>Issure Pre-IRQ event when DMASZ=8</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQ_32</name>
                    <description>Issure Pre-IRQ event when DMASZ=32</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQ_64</name>
                    <description>Issure Pre-IRQ event when DMASZ=64</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PREIRQ_HALF</name>
                    <description>Issure Pre-IRQ event when DMASZ reached the half size point of the original transfer size</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DMA_DMASA</name>
            <description>DMA Channel Source Address</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>ADDR</name>
                <description>DMA Channel Source Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DMA_DMADA</name>
            <description>DMA Channel Destination Address</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>ADDR</name>
                <description>DMA Channel Destination Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DMA_DMASZ</name>
            <description>DMA Channel Size</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>SIZE</name>
                <description>DMA Channel Size in number of transfers</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
