exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LFSS_PSCTL</name>
          <description>RTC Prescale Timer 0/1 Control Register</description>
          <addressOffset>0x1148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RT0IP</name>
              <description>Prescale timer 0 interrupt interval</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT244US</name>
                  <description>Interval every 244 microsecond</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT488US</name>
                  <description>Interval every 488 microsecond</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT0P98MS</name>
                  <description>Interval every 0.98 milisecond</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT1P95MS</name>
                  <description>Interval every 1.95 milisecond</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT3P91MS</name>
                  <description>Interval every 3.91 milisecond</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT7P81MS</name>
                  <description>Interval every 7.81 milisecond</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1IP</name>
              <description>Prescale timer 1 interrupt interval</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT15P6MS</name>
                  <description>Interval every 15.6 milisecond</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT31P3MS</name>
                  <description>Interval every 31.3 milisecond</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT62P5MS</name>
                  <description>Interval every 62.5 milisecond</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT125MS</name>
                  <description>Interval every 125 milisecond</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT250MS</name>
                  <description>Interval every 250 milisecond</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT500MS</name>
                  <description>Interval every 500 milisecond</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT1S</name>
                  <description>Interval every 1 second</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT2S</name>
                  <description>Interval every 2 second</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_EXTPSCTL</name>
          <description>RTC Prescale Timer 2 Control Register</description>
          <addressOffset>0x114C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RT2PS</name>
              <description>Prescale timer 2 interrupt interval</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT4S</name>
                  <description>Interval every 4 second</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT8S</name>
                  <description>Interval every 8 second</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT16S</name>
                  <description>Interval every 16 second</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_TSSEC</name>
          <description>Time Stamp Seconds Register - Calendar Mode With Binary / BCD Format</description>
          <addressOffset>0x1150</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECBIN</name>
              <description>Time Stamp Second Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SECLOWBCD</name>
              <description>Time Stamp Seconds BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SECHIGHBCD</name>
              <description>Time Stamp Seconds BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_TSMIN</name>
          <description>Time Stamp Minutes Register - Calendar Mode With Binary / BCD Format</description>
          <addressOffset>0x1154</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MINBIN</name>
              <description>Time Stamp Minutes Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINLOWBCD</name>
              <description>Time Stamp Minutes BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINHIGHBCD</name>
              <description>Time Stamp Minutes BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_TSHOUR</name>
          <description>Time Stamp Hours Register - Calendar Mode With Binary / BCD Format</description>
          <addressOffset>0x1158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HOURBIN</name>
              <description>Time Stamp Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOURLOWBCD</name>
              <description>Time Stamp Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOURHIGHBCD</name>
              <description>Time Stamp Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_TSDAY</name>
          <description>Time Stamp Day Of Week / MonthRegister - Calendar Mode With Binary / BCD Format</description>
          <addressOffset>0x115C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DOW</name>
              <description>Time Stamp Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOMBIN</name>
              <description>Time Stamp Day of month Binary (1 to 28, 29, 30, 31) If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOMLOWBCD</name>
              <description>Time Stamp Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOMHIGHBCD</name>
              <description>Time Stamp Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_TSMON</name>
          <description>Time Stamp Month Register - Calendar Mode With Binary / BCD Format</description>
          <addressOffset>0x1160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MONBIN</name>
              <description>Time Stamp Month Binary (1 to 12). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MONLOWBCD</name>
              <description>Time Stamp Month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MONHIGHBCD</name>
              <description>Time Stamp Month BCD  high digit (0 or 1). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_TSYEAR</name>
          <description>Time Stamp Years Register - Calendar Mode With Binary / BCD Format</description>
          <addressOffset>0x1164</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>YEARLOWBIN</name>
              <description>Time Stamp Year Binary  low byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YEARHIGHBIN</name>
              <description>Time Stamp Year Binary  high byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YERARLOWESTBCD</name>
              <description>Time Stamp Year BCD  lowest digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECADEBCD</name>
              <description>Time Stamp Decade BCD (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CENTLOWBCD</name>
              <description>Time Stamp Century BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CENTHIGHBCD</name>
              <description>Time Stamp Century BCD  high digit (0 to 4). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
