exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LFSS_TIN15_12</name>
          <description>Tamper Input Register</description>
          <addressOffset>0x12AC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIO12</name>
              <description>This bit reads the data input value of tamper I/O 12.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Input value is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Input value is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIO13</name>
              <description>This bit reads the data input value of tamper I/O 13.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Input value is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Input value is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIO14</name>
              <description>This bit reads the data input value of tamper I/O 14.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Input value is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Input value is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIO15</name>
              <description>This bit reads the data input value of tamper I/O 15.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Input value is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Input value is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_HEARTBEAT</name>
          <description>Heartbeat Register</description>
          <addressOffset>0x12C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HBINTERVAL</name>
              <description>Heart beat interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HBINT0P125</name>
                  <description>Heart beat interval 0.125 sec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBINT0P25</name>
                  <description>Heart beat interval 0.25 sec</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBINT0P5</name>
                  <description>Heart beat interval 0.5 sec</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBINT1</name>
                  <description>Heart beat interval 1 sec</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBINT2</name>
                  <description>Heart beat interval 2 sec</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBINT4</name>
                  <description>Heart beat interval 4 sec</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBINT8</name>
                  <description>Heart beat interval 8 sec</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBINT16</name>
                  <description>Heart beat interval 16 sec</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HBWIDTH</name>
              <description>Heart beat interval width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HBPWDTH1</name>
                  <description>Heart beat pulse width 1 msec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBPWDTH2</name>
                  <description>Heart beat pulse width 2 msec</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBPWDTH4</name>
                  <description>Heart beat pulse width 4 msec</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBPWDTH8</name>
                  <description>Heart beat pulse width 8 msec</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBPWDTH16</name>
                  <description>Heart beat pulse width 16 msec</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBPWDTH32</name>
                  <description>Heart beat pulse width 32 msec</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBPWDTH64</name>
                  <description>Heart beat pulse width 64 msec</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HBPWDTH128</name>
                  <description>Heart beat pulse width 128 msec</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HBMODE</name>
              <description>Heart beat mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HB_DIS</name>
                  <description>Heart beat disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HB_ALLWAYS</name>
                  <description>Heart beat allways enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HB_TS</name>
                  <description>Heart beat enabled when time stamp event detected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HB_VDDFAIL</name>
                  <description>Heart beat when VDD has fail condition</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_TIOLOCK</name>
          <description>Tamper I/O lock register</description>
          <addressOffset>0x12FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PROTECT</name>
              <description>If set, the register bit will protect the TIOCTL and HEARTBEAT from accidental writes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Tamper I/O control is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Tamper I/O control is read only access.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_WDTEN</name>
          <description>Watchdog Timer Enable Register</description>
          <addressOffset>0x1300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit for the WDT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Disable WDT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Enable WDT</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_WDTDBGCTL</name>
          <description>Watchdog Timer Debug Control Register</description>
          <addressOffset>0x1304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREE</name>
              <description>Free run control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>The WDT freezes functionality while the CPU is Halted during debug and resumes when the CPU is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>The WDT ignores the state of the CPU Halted debug state.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_WDTCTL</name>
          <description>Watchdog Timer Control Register</description>
          <addressOffset>0x1308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000043</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Module Clock Divider, Divide the clock source by CLKDIV+1. Divider values from /1 to /8 are possible.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Minimum value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>Maximum value</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>Timer Period of the WDT. These bits select the total watchdog timer count.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_EN_25</name>
                  <description>Total timer count is 2^25</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EN_21</name>
                  <description>Total timer count is 2^21</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EN_18</name>
                  <description>Total timer count is 2^18</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EN_15</name>
                  <description>Total timer count is 2^15</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EN_12</name>
                  <description>Total timer count is 2^12 (default)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EN_10</name>
                  <description>Total timer count is 2^10</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EN_8</name>
                  <description>Total timer count is 2^8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_EN_6</name>
                  <description>Total timer count is 2^6</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_WDTCNTRST</name>
          <description>Watchdog Timer Counter Reset Register</description>
          <addressOffset>0x130C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESTART</name>
              <description>Writing 03A7h to this register restarts the WDT Counter. Writing any other value causes a POR level reset. Read as 0x0h.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALUE</name>
                  <description>VALUE to restart the WDT counter</description>
                  <value>935</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_WDTSTAT</name>
          <description>Watchdog Timer Status Register</description>
          <addressOffset>0x1310</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RUN</name>
              <description>Watchdog running status flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Watchdog counter stopped.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Watchdog running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSS_WDTLOCK</name>
          <description>Watchdog timer lock register</description>
          <addressOffset>0x13FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PROTECT</name>
              <description>If set, the register bit will protect the WDTEN and WDTCTL from accidental writes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Watchdog timer control is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Watchdog timer control is read only access.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex/>
          <name>LFSS_SPMEM[%s]</name>
          <description>Scratch Pad Memory Data Register</description>
          <addressOffset>0x1400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA3</name>
              <description>memory data byte 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>memory data byte 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>memory data byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA0</name>
              <description>memory data byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
