exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LFSS_SPMWPROT0</name>
          <description>Scratch Pad Memory Write Protect Register 0</description>
          <addressOffset>0x1500</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WP_3_3</name>
              <description>write protect SPMEM3 - DATA3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_3_2</name>
              <description>write protect SPMEM3 - DATA2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_3_1</name>
              <description>write protect SPMEM3 - DATA1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_3_0</name>
              <description>write protect SPMEM3 - DATA0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_2_3</name>
              <description>write protect SPMEM2 - DATA3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_2_2</name>
              <description>write protect SPMEM2 - DATA2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_2_1</name>
              <description>write protect SPMEM2 - DATA1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_2_0</name>
              <description>write protect SPMEM2 - DATA0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_1_3</name>
              <description>write protect SPMEM1 - DATA3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_1_2</name>
              <description>write protect SPMEM1 - DATA2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_1_1</name>
              <description>write protect SPMEM1 - DATA1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_1_0</name>
              <description>write protect SPMEM1 - DATA0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_0_3</name>
              <description>write protect SPMEM0 - DATA3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_0_2</name>
              <description>write protect SPMEM0 - DATA2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_0_1</name>
              <description>write protect SPMEM0 - DATA1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_0_0</name>
              <description>write protect SPMEM0 - DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
