exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LFSS_SPMWPROT3</name>
          <description>Scratch Pad Memory Write Protect Register 3</description>
          <addressOffset>0x150C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WP_15_3</name>
              <description>write protect SPMEM15 - DATA3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_15_2</name>
              <description>write protect SPMEM15 - DATA2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_15_1</name>
              <description>write protect SPMEM15 - DATA1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_15_0</name>
              <description>write protect SPMEM15 - DATA0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_14_3</name>
              <description>write protect SPMEM14 - DATA3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_14_2</name>
              <description>write protect SPMEM14- DATA2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_14_1</name>
              <description>write protect SPMEM14 - DATA1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_14_0</name>
              <description>write protect SPMEM14 - DATA0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_13_3</name>
              <description>write protect SPMEM13 - DATA3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_13_2</name>
              <description>write protect SPMEM13 - DATA2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_13_1</name>
              <description>write protect SPMEM13 - DATA1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_13_0</name>
              <description>write protect SPMEM13 - DATA0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_12_3</name>
              <description>write protect SPMEM12 - DATA3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_12_2</name>
              <description>write protect SPMEM12 - DATA2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_12_1</name>
              <description>write protect SPMEM12 - DATA1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_12_0</name>
              <description>write protect SPMEM12 - DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
