exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LFSS_SPMWPROT5</name>
          <description>Scratch Pad Memory Write Protect Register 5</description>
          <addressOffset>0x1514</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WP_23_3</name>
              <description>write protect SPMEM23 - DATA3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_23_2</name>
              <description>write protect SPMEM23 - DATA2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_23_1</name>
              <description>write protect SPMEM23 - DATA1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_23_0</name>
              <description>write protect SPMEM23 - DATA0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_22_3</name>
              <description>write protect SPMEM22 - DATA3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_22_2</name>
              <description>write protect SPMEM22- DATA2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_22_1</name>
              <description>write protect SPMEM22 - DATA1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_22_0</name>
              <description>write protect SPMEM22 - DATA0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_21_3</name>
              <description>write protect SPMEM21 - DATA3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_21_2</name>
              <description>write protect SPMEM21 - DATA2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_21_1</name>
              <description>write protect SPMEM21 - DATA1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_21_0</name>
              <description>write protect SPMEM21 - DATA0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_20_3</name>
              <description>write protect SPMEM20 - DATA3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_20_2</name>
              <description>write protect SPMEM20 - DATA2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_20_1</name>
              <description>write protect SPMEM20 - DATA1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_20_0</name>
              <description>write protect SPMEM20 - DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
