exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LFSS_SPMWPROT6</name>
          <description>Scratch Pad Memory Write Protect Register 6</description>
          <addressOffset>0x1518</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WP_27_3</name>
              <description>write protect SPMEM27 - DATA3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_27_2</name>
              <description>write protect SPMEM27 - DATA2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_27_1</name>
              <description>write protect SPMEM27 - DATA1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_27_0</name>
              <description>write protect SPMEM27 - DATA0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_26_3</name>
              <description>write protect SPMEM26 - DATA3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_26_2</name>
              <description>write protect SPMEM26- DATA2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_26_1</name>
              <description>write protect SPMEM26 - DATA1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_26_0</name>
              <description>write protect SPMEM26 - DATA0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_25_3</name>
              <description>write protect SPMEM25 - DATA3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_25_2</name>
              <description>write protect SPMEM25 - DATA2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_25_1</name>
              <description>write protect SPMEM25 - DATA1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_25_0</name>
              <description>write protect SPMEM25 - DATA0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_24_3</name>
              <description>write protect SPMEM24 - DATA3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_24_2</name>
              <description>write protect SPMEM24 - DATA2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_24_1</name>
              <description>write protect SPMEM24 - DATA1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_24_0</name>
              <description>write protect SPMEM24 - DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
