exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LFSS_SPMWPROT7</name>
          <description>Scratch Pad Memory Write Protect Register 7</description>
          <addressOffset>0x151C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WP_31_3</name>
              <description>write protect SPMEM31 - DATA3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_31_2</name>
              <description>write protect SPMEM31 - DATA2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_31_1</name>
              <description>write protect SPMEM31 - DATA1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_31_0</name>
              <description>write protect SPMEM31 - DATA0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_30_3</name>
              <description>write protect SPMEM30 - DATA3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_30_2</name>
              <description>write protect SPMEM30- DATA2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_30_1</name>
              <description>write protect SPMEM30 - DATA1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_30_0</name>
              <description>write protect SPMEM30 - DATA0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_29_3</name>
              <description>write protect SPMEM29 - DATA3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_29_2</name>
              <description>write protect SPMEM29 - DATA2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_29_1</name>
              <description>write protect SPMEM29 - DATA1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_29_0</name>
              <description>write protect SPMEM29 - DATA0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_28_3</name>
              <description>write protect SPMEM28 - DATA3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_28_2</name>
              <description>write protect SPMEM28 - DATA2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_28_1</name>
              <description>write protect SPMEM28 - DATA1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP_28_0</name>
              <description>write protect SPMEM28 - DATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>SPMEM is read and write access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>SPMEM is read only access</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
