exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>SYSCTL_GENCLKCFG</name>
          <description>General clock configuration</description>
          <addressOffset>0x1138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFF2F7</resetMask>
          <fields>
            <field>
              <name>HFCLK4MFPCLKDIV</name>
              <description>HFCLK4MFPCLKDIV selects the divider applied to HFCLK when HFCLK is used as the MFPCLK source.  Integer dividers from /1 to /16 may be selected.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>HFCLK is not divided before being used for MFPCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>HFCLK is divided by 2 before being used for MFPCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>HFCLK is divided by 3 before being used for MFPCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>HFCLK is divided by 4 before being used for MFPCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV5</name>
                  <description>HFCLK is divided by 5 before being used for MFPCLK</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>HFCLK is divided by 6 before being used for MFPCLK</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV7</name>
                  <description>HFCLK is divided by 7 before being used for MFPCLK</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>HFCLK is divided by 8 before being used for MFPCLK</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV9</name>
                  <description>HFCLK is divided by 9 before being used for MFPCLK</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <description>HFCLK is divided by 10 before being used for MFPCLK</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV11</name>
                  <description>HFCLK is divided by 11 before being used for MFPCLK</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>HFCLK is divided by 12 before being used for MFPCLK</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV13</name>
                  <description>HFCLK is divided by 13 before being used for MFPCLK</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV14</name>
                  <description>HFCLK is divided by 14 before being used for MFPCLK</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV15</name>
                  <description>HFCLK is divided by 15 before being used for MFPCLK</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>HFCLK is divided by 16 before being used for MFPCLK</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFPCLKSRC</name>
              <description>MFPCLKSRC selects the MFPCLK (middle frequency precision clock) source.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSOSC</name>
                  <description>MFPCLK is sourced from SYSOSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>MFPCLK is sourced from HFCLK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCTRIGCNT</name>
              <description>FCCTRIGCNT specifies the number of trigger clock periods in the trigger window. FCCTRIGCNT=0h (one trigger clock period) up to 1Fh (32 trigger clock periods) may be specified.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANACPUMPCFG</name>
              <description>ANACPUMPCFG selects the analog mux charge pump (VBOOST) enable method.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONDEMAND</name>
                  <description>VBOOST is enabled on request from a COMP, GPAMP, or OPA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONACTIVE</name>
                  <description>VBOOST is enabled when the device is in RUN or SLEEP mode, or when a COMP/GPAMP/OPA is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONALWAYS</name>
                  <description>VBOOST is always enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCSELCLK</name>
              <description>FCCSELCLK selectes the frequency clock counter (FCC) clock source.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCLK</name>
                  <description>FCC clock is MCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSOSC</name>
                  <description>FCC clock is SYSOSC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>FCC clock is HFCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>FCC clock is the CLK_OUT selection</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCIN</name>
                  <description>FCC clock is the FCCIN external input</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCTRIGSRC</name>
              <description>FCCTRIGSRC selects the frequency clock counter (FCC) trigger source.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTPIN</name>
                  <description>FCC trigger is the external pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFCLK</name>
                  <description>FCC trigger is the LFCLK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCLVLTRIG</name>
              <description>FCCLVLTRIG selects the frequency clock counter (FCC) trigger mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISE2RISE</name>
                  <description>Rising edge to rising edge triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level triggered</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLKSRC</name>
              <description>EXCLKSRC selects the source for the CLK_OUT external clock output block.  ULPCLK and MFPCLK require the CLK_OUT divider (EXCLKDIVEN) to be enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSOSC</name>
                  <description>CLK_OUT is SYSOSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPCLK</name>
                  <description>CLK_OUT is ULPCLK (EXCLKDIVEN must be enabled)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFCLK</name>
                  <description>CLK_OUT is LFCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MFPCLK</name>
                  <description>CLK_OUT is MFPCLK (EXCLKDIVEN must be enabled)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>CLK_OUT is HFCLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLKDIVVAL</name>
              <description>EXCLKDIVVAL selects the divider value for the divider in the CLK_OUT external clock output block.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>CLK_OUT source is divided by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_OUT source is divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>CLK_OUT source is divided by 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_OUT source is divided by 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <description>CLK_OUT source is divided by 10</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>CLK_OUT source is divided by 12</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV14</name>
                  <description>CLK_OUT source is divided by 14</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_OUT source is divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXCLKDIVEN</name>
              <description>EXCLKDIVEN enables or disables the divider function of the CLK_OUT external clock output block.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSTHRU</name>
                  <description>CLock divider is disabled (passthrough, EXCLKDIVVAL is not applied)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Clock divider is enabled (EXCLKDIVVAL is applied)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_GENCLKEN</name>
          <description>General clock enable control</description>
          <addressOffset>0x113C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>
          <fields>
            <field>
              <name>EXCLKEN</name>
              <description>EXCLKEN enables the CLK_OUT external clock output block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>CLK_OUT block is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>CLK_OUT block is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFPCLKEN</name>
              <description>MFPCLKEN enables the middle frequency precision clock (MFPCLK).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>MFPCLK is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MFPCLK is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_PMODECFG</name>
          <description>Power mode configuration</description>
          <addressOffset>0x1140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>DSLEEP</name>
              <description>DSLEEP selects the operating mode to enter upon a DEEPSLEEP request from the CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>STOP mode is entered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>STANDBY mode is entered</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>SHUTDOWN mode is entered</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_FCC</name>
          <description>Frequency clock counter (FCC) count</description>
          <addressOffset>0x1150</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Frequency clock counter (FCC) count value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SYSOSCTRIMUSER</name>
          <description>SYSOSC user-specified trim</description>
          <addressOffset>0x1170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFF3F73</resetMask>
          <fields>
            <field>
              <name>RESCOARSE</name>
              <description>RESCOARSE specifies the resister coarse trim.  This value changes with the target frequency.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESFINE</name>
              <description>RESFINE specifies the resister fine trim.  This value changes with the target frequency.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDIV</name>
              <description>RDIV specifies the frequency correction loop (FCL) resistor trim.  This value changes with the target frequency.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ</name>
              <description>FREQ specifies the target user-trimmed frequency for SYSOSC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSOSC16M</name>
                  <description>16MHz user frequency</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSOSC24M</name>
                  <description>24MHz user frequency</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>CAP specifies the SYSOSC capacitor trim.  This value changes with the target frequency.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SRAMBOUNDARY</name>
          <description>SRAM Write Boundary</description>
          <addressOffset>0x1178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFE0</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>SRAM boundary configuration. The value configured into this acts such that: SRAM accesses to addresses less than or equal value will be RW only. SRAM accesses to addresses greater than value will be RX only. Value of 0 is not valid (system will have no stack). If set to 0, the system acts as if the entire SRAM is RWX.  Any non-zero value can be configured, including a value = SRAM size.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
