exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>SYSCTL_SYSSTATUS</name>
          <description>System status information</description>
          <addressOffset>0x1208</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC00070FF</resetMask>
          <fields>
            <field>
              <name>SHDNIOLOCK</name>
              <description>SHDNIOLOCK indicates when IO is locked due to SHUTDOWN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>IO IS NOT Locked due to SHUTDOWN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>IO IS Locked due to SHUTDOWN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTRSTPINDIS</name>
              <description>EXTRSTPINDIS indicates when user has disabled the use of external reset pin</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>External Reset Pin Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>External Reset Pin Disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBATGOOD</name>
              <description>VBATGOOD is set by hardware when the VBAT Power Domain is valid.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>VBAT Power Domain is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>VBAT Power Domain is valid</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUIREFGOOD</name>
              <description>PMUIREFGOOD is set by hardware when the PMU current reference is ready.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>IREF is not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>IREF is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWDCFGDIS</name>
              <description>SWDCFGDIS indicates when user has disabled the use of SWD Port</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>SWD Port Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>SWD Port Disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANACPUMPGOOD</name>
              <description>ANACPUMPGOOD is set by hardware when the VBOOST analog mux charge pump is ready.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>VBOOST is not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>VBOOST is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REBOOTATTEMPTS</name>
              <description>REBOOTATTEMPTS indicates the number of boot attempts taken before the user application starts.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BORLVL</name>
              <description>BORLVL indicates if a BOR event occured and the BOR threshold was switched to BOR0 by hardware.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>No BOR violation occured</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>A BOR violation occured and the BOR threshold was switched to BOR0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHDED</name>
              <description>FLASHDED indicates if a flash ECC double bit error was detected (DED).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>No flash ECC double bit error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Flash ECC double bit error detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHSEC</name>
              <description>FLASHSEC indicates if a flash ECC single bit error was detected and corrected (SEC).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>No flash ECC single bit error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Flash ECC single bit error was detected and corrected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BORCURTHRESHOLD</name>
              <description>BORCURTHRESHOLD indicates the active brown-out reset supply monitor configuration.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BORMIN</name>
                  <description>Default minimum threshold; a BOR0- violation triggers a BOR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORLEVEL1</name>
                  <description>A BOR1- violation generates a BORLVL interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORLEVEL2</name>
                  <description>A BOR2- violation generates a BORLVL interrupt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORLEVEL3</name>
                  <description>A BOR3- violation generates a BORLVL interrupt</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_DEDERRADDR</name>
          <description>Memory DED Address</description>
          <addressOffset>0x120C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSCTL_RSTCAUSE</name>
          <description>Reset cause</description>
          <addressOffset>0x1220</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>ID is a read-to-clear field which indicates the lowest level reset cause since the last read.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORST</name>
                  <description>No reset since last read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORHWFAIL</name>
                  <description>POR- violation, SHUTDNSTOREx or PMU trim parity fault</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POREXNRST</name>
                  <description>NRST triggered POR (&amp;gt;1s hold)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORSW</name>
                  <description>Software triggered POR</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORSUPPLY</name>
                  <description>BOR0- violation</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORWAKESHUTDN</name>
                  <description>SHUTDOWN mode exit</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTNONPMUPARITY</name>
                  <description>Non-PMU trim parity fault</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTCLKFAIL</name>
                  <description>Fatal clock failure</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTEXNRST</name>
                  <description>NRST triggered BOOTRST (&amp;lt;1s hold)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTSW</name>
                  <description>Software triggered BOOTRST</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSWWDT0</name>
                  <description>WWDT0 violation</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSBSLEXIT</name>
                  <description>BSL exit</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSBSLENTRY</name>
                  <description>BSL entry</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSWWDT1</name>
                  <description>WWDT1 violation</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSFLASHECC</name>
                  <description>Flash uncorrectable ECC error</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCPULOCK</name>
                  <description>CPULOCK violation</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSDBG</name>
                  <description>Debug triggered SYSRST</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSW</name>
                  <description>Software triggered SYSRST</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPUDBG</name>
                  <description>Debug triggered CPURST</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPUSW</name>
                  <description>Software triggered CPURST</description>
                  <value>29</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_RESETLEVEL</name>
          <description>Reset level for application-triggered reset command</description>
          <addressOffset>0x1300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>LEVEL</name>
              <description>LEVEL is used to specify the type of reset to be issued when RESETCMD is set to generate a software triggered reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Issue a SYSRST (CPU plus peripherals only)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>Issue a BOOTRST (CPU, peripherals, and boot configuration routine)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTLOADERENTRY</name>
                  <description>Issue a SYSRST and enter the boot strap loader (BSL)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <description>Issue a power-on reset (POR)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTLOADEREXIT</name>
                  <description>Issue a SYSRST and exit the boot strap loader (BSL)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_RESETCMD</name>
          <description>Execute an application-triggered reset command</description>
          <addressOffset>0x1304</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF000001</resetMask>
          <fields>
            <field>
              <name>GO</name>
              <description>Execute the reset specified in RESETLEVEL.LEVEL.  Must be written together with the KEY.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Issue reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_BORTHRESHOLD</name>
          <description>BOR threshold selection</description>
          <addressOffset>0x1308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LEVEL</name>
              <description>LEVEL specifies the desired BOR threshold and BOR mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BORMIN</name>
                  <description>Default minimum threshold; a BOR0- violation triggers a BOR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORLEVEL1</name>
                  <description>A BOR1- violation generates a BORLVL interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORLEVEL2</name>
                  <description>A BOR2- violation generates a BORLVL interrupt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORLEVEL3</name>
                  <description>A BOR3- violation generates a BORLVL interrupt</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_BORCLRCMD</name>
          <description>Set the BOR threshold</description>
          <addressOffset>0x130C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF000001</resetMask>
          <fields>
            <field>
              <name>GO</name>
              <description>GO clears any prior BOR violation status indications and attempts to change the active BOR mode to that specified in the LEVEL field of the BORTHRESHOLD register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Issue clear</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCTL_SYSOSCFCLCTL</name>
          <description>SYSOSC frequency correction loop (FCL) ROSC enable</description>
          <addressOffset>0x1310</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF000003</resetMask>
          <fields>
            <field>
              <name>SETUSEFCL</name>
              <description>Set SETUSEFCL to enable the frequency correction loop in SYSOSC.  Once enabled, this state is locked until the next BOOTRST.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Enable the SYSOSC FCL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETUSEEXRES</name>
              <description>Set SETUSEEXRES to specify that an external resistor will be used for the FCL.  An appropriate resistor must be populated on the ROSC pin.  This state is locked until the next BOOTRST.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Enable the SYSOSC external Resistor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
