exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>TIMG5_CCCTL_01[%s]</name>
            <description>Capture or Compare Control Registers</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCOND</name>
                <description>Capture Condition. #br# Specifies the condition that generates a capture pulse. 4h-Fh = Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOCAPTURE</name>
                    <description>None (never captures)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_RISE</name>
                    <description>Rising edge of CCP or trigger assertion edge</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_FALL</name>
                    <description>Falling edge of CCP or trigger de-assertion edge</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_EDGE</name>
                    <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACOND</name>
                <description>Advance Condition. #br# Specifies the condition that generates an advance pulse. 6h-Fh = Reserved</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TIMCLK</name>
                    <description>Each TIMCLK</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_RISE</name>
                    <description>Rising edge of CCP or trigger assertion edge</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_FALL</name>
                    <description>Falling edge of CCP or trigger de-assertion edge</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_EDGE</name>
                    <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_HIGH</name>
                    <description>CCP High or Trigger assertion (level)</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LCOND</name>
                <description>Load Condition. #br# Specifies the condition that generates a load pulse.  4h-Fh = Reserved</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CC_TRIG_RISE</name>
                    <description>Rising edge of CCP or trigger assertion edge</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_FALL</name>
                    <description>Falling edge of CCP or trigger de-assertion edge</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_EDGE</name>
                    <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ZCOND</name>
                <description>Zero Condition. #br# This field specifies the condition that generates a zero pulse. 4h-Fh = Reserved</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CC_TRIG_RISE</name>
                    <description>Rising edge of CCP or trigger assertion edge</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_FALL</name>
                    <description>Falling edge of CCP or trigger de-assertion edge</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC_TRIG_EDGE</name>
                    <description>Either edge of CCP or trigger change (assertion/de-assertion edge)</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COC</name>
                <description>Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both).</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>COMPARE</name>
                    <description>Compare</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAPTURE</name>
                    <description>Capture</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCUPD</name>
                <description>Capture and Compare Update Method
This field controls how updates to the pipelined
capture and compare register are performed
(when operating in compare mode, COC=0).</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Immediately</name>
                    <description>Writes to the CCx_y register is written to the register directly and has immediate effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Zero_EVT</name>
                    <description>Following a zero event Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Compare_Down_EVT</name>
                    <description>Following a compare (down) event Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Compare_UP_EVT</name>
                    <description>Following a compare (up) event Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO_LOAD_EVT</name>
                    <description>Following a zero or load event Writes to the CCx_y register are stored in shadow register and transferred to ECCx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LD.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO_RC_ZERO_EVT</name>
                    <description>Following a zero event with repeat count also zero.  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG</name>
                    <description>Following a TRIG pulse.  Writes to the CCx_y register are stored in shadow register and transferred to CCx_y #xD;
0.</description>
                    <value>6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCACTUPD</name>
                <description>CCACT shadow register Update Method
This field controls how updates to the CCCACT shadow register are performed</description>
                <bitOffset>26</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Immediately</name>
                    <description>Value written to the CCACT register has immediate effect.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Zero_EVT</name>
                    <description>Following a zero event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Compare_Down_EVT</name>
                    <description>Following a compare (down) event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Compare_UP_EVT</name>
                    <description>Following a compare (up) event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO_LOAD_EVT</name>
                    <description>Following a zero or load event Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO_RC_ZERO_EVT</name>
                    <description>Following a zero event with repeat count also zero.  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG</name>
                    <description>On a TRIG pulse, the value stored in CCACTx_y shadow register is loaded into CCACTx_y active register.</description>
                    <value>6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CC2SELU</name>
                <description>Selects the source second CCU event.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SEL_CCU0</name>
                    <description>Selects CCU from CC0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCU1</name>
                    <description>Selects CCU from CC1.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCU2</name>
                    <description>Selects CCU from CC2.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCU3</name>
                    <description>Selects CCU from CC3.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCU4</name>
                    <description>Selects CCU from CC4.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCU5</name>
                    <description>Selects CCU from CC5.</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CC2SELD</name>
                <description>Selects the source second CCD event.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SEL_CCD0</name>
                    <description>Selects CCD from CC0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCD1</name>
                    <description>Selects CCD from CC1.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCD2</name>
                    <description>Selects CCD from CC2.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCD3</name>
                    <description>Selects CCD from CC3.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCD4</name>
                    <description>Selects CCD from CC4.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SEL_CCD5</name>
                    <description>Selects CCD from CC5.</description>
                    <value>5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>TIMG5_OCTL_01[%s]</name>
            <description>CCP Output Control Registers</description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CCPOINV</name>
                <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOINV</name>
                    <description>No inversion</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INV</name>
                    <description>Invert</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCPIV</name>
                <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LOW</name>
                    <description>Low</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGH</name>
                    <description>High</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCPO</name>
                <description>CCP Output Source</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FUNCVAL</name>
                    <description>Signal generator value (for example, PWM, triggered PWM)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOAD</name>
                    <description>Load condition</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CMPVAL</name>
                    <description>Compare value = counter condition</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO</name>
                    <description>Zero condition</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CAPCOND</name>
                    <description>Capture condition</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FAULTCOND</name>
                    <description>Fault Condition</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC0_MIRROR_ALL</name>
                    <description>Mirror CCP of first capture and compare register in counter group</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC1_MIRROR_ALL</name>
                    <description>Mirror CCP of second capture and compare register in counter group</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DEADBAND</name>
                    <description>Deadband Inserted Output</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CNTDIR</name>
                    <description>Counter direction</description>
                    <value>13</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
