exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>TIMG5_CCACT_01[%s]</name>
            <description>Capture or Compare Action Registers</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ZACT</name>
                <description>CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LACT</name>
                <description>CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CDACT</name>
                <description>CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CUACT</name>
                <description>CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CC2DACT</name>
                <description>CCP Output Action on CC2D event.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CC2UACT</name>
                <description>CCP Output Action on CC2U event.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_TOGGLE</name>
                    <description>CCP output value is toggled</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWFRCACT</name>
                <description>CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_HIGH</name>
                    <description>CCP output value is set high</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_LOW</name>
                    <description>CCP output value is set low</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimArrayIndex/>
            <name>TIMG5_IFCTL_01[%s]</name>
            <description>Input Filter Control Register</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ISEL</name>
                <description>Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CCPX_INPUT</name>
                    <description>CCP of the corresponding capture compare unit</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCPX_INPUT_PAIR</name>
                    <description>Input pair CCPX of the capture compare unit. For CCP0 input pair is CCP1 and for CCP1 input pair is CCP0.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP0_INPUT</name>
                    <description>CCP0 of the counter</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_INPUT</name>
                    <description>Trigger</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCP_XOR</name>
                    <description>XOR of CCP inputs as input source.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FSUB0</name>
                    <description>subscriber 0 event as input source.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FSUB1</name>
                    <description>subscriber 1 event as input source.</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>COMP0</name>
                    <description>Comparator 0 output.</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>COMP1</name>
                    <description>Comparator 1 output.</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>COMP2</name>
                    <description>Comparator 2 output.</description>
                    <value>9</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INV</name>
                <description>Input Inversion This bit controls whether the selected input is inverted.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOINVERT</name>
                    <description>Noninverted</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERT</name>
                    <description>Inverted</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FP</name>
                <description>Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>_3</name>
                    <description>The division factor is 3</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>_5</name>
                    <description>The division factor is 5</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>_8</name>
                    <description>The division factor is 8</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CPV</name>
                <description>Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Consecutive</name>
                    <description>Consecutive Periods The input must be at a specific logic level for the period defined by FP before it is passed to the filter output.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Voting</name>
                    <description>Voting  The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FE</name>
                <description>Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Bypass.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Filtered.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
