exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
          <register>
            <name>TIMG5_TSEL</name>
            <description>Trigger Select</description>
            <addressOffset>0xB0</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ETSEL</name>
                <description>External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules in the same power domain. Refer to the SoC datasheet to get details.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TRIG0</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG1</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG2</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG3</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG4</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG5</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG6</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG7</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG8</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG9</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG10</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG11</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG12</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG13</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG14</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG15</name>
                    <description>TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer.</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_SUB0</name>
                    <description>TRIG_SUBx = External trigger input from subscriber port x.</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIG_SUB1</name>
                    <description>TRIG_SUBx = External trigger input from subscriber port x.</description>
                    <value>17</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TE</name>
                <description>Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Triggers are not used.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Triggers are used as selected by the IE, ITSEL and ETSEL fields.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
