exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LCD_LCDCTL0</name>
          <description>LCD control register 0</description>
          <addressOffset>0x1100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDDIVx</name>
              <description>LCD frequency divider. Together with LCDMXx, the LCD frequency fLCD is calculated as fLCD = fSOURCE / ((LCDDIVx + 1) * Value[LCDMXx]). Change only while LCDON = 0.  00000b = Divide by 1 00001b = Divide by 2 .  11110b = Divide by 31 11111b = Divide by 32</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_3</name>
                  <description>Divide by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>Divide by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_5</name>
                  <description>Divide by 5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_6</name>
                  <description>Divide by 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_7</name>
                  <description>Divide by 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>Divide by 8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_9</name>
                  <description>Divide by 9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_10</name>
                  <description>Divide by 10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_11</name>
                  <description>Divide by 11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_12</name>
                  <description>Divide by 12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_13</name>
                  <description>Divide by 13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_14</name>
                  <description>Divide by 14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_15</name>
                  <description>Divide by 15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_16</name>
                  <description>Divide by 16</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_17</name>
                  <description>Divide by 17</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_18</name>
                  <description>Divide by 18</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_19</name>
                  <description>Divide by 19</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_20</name>
                  <description>Divide by 20</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_21</name>
                  <description>Divide by 21</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_22</name>
                  <description>Divide by 22</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_23</name>
                  <description>Divide by 23</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_24</name>
                  <description>Divide by 24</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_25</name>
                  <description>Divide by 25</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_26</name>
                  <description>Divide by 26</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_27</name>
                  <description>Divide by 27</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_28</name>
                  <description>Divide by 28</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_29</name>
                  <description>Divide by 29</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_30</name>
                  <description>Divide by 30</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_31</name>
                  <description>Divide by 31</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_32</name>
                  <description>Divide by 32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDLP</name>
              <description>LCD low-power waveform. This bit is only applicable for 1/3 bias mode, that is, for LCDBIASSEL = 0.  0b = Standard LCD waveforms on segment and common lines selected.  1b = Low-power LCD waveforms on segment and common lines selected.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STD_LCD</name>
                  <description>Standard LCD waveforms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_LCD</name>
                  <description>Low power LCD waveforms</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDMXx</name>
              <description>LCD mux rate. These bits select the LCD mode. Change only while LCDON = 0.  000b = Static 001b = 2-mux 010b = 3-mux 011b = 4-mux 100b = 5-mux 101b = 6-mux 110b = 7-mux 111b = 8-mux</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mx_STATIC</name>
                  <description>Static</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_2</name>
                  <description>2-mux</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_3</name>
                  <description>3-mux</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_4</name>
                  <description>4-mux</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_5</name>
                  <description>5-mux</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_6</name>
                  <description>6-mux</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_7</name>
                  <description>7-mux</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_8</name>
                  <description>8-mux</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDON</name>
              <description>LCD on. This bit turns the LCD module on or off.  0b = LCD module off 1b = LCD module on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_MOD_DISABLE</name>
                  <description>LCD module off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_MOD_ENABLE</name>
                  <description>LCD module on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDSON</name>
              <description>LCD segments on. This bit supports flashing LCD applications by turning off all segment lines, while leaving the LCD timing generator and R33 enabled.  0b = All LCD segments are off.  1b = All LCD segments are enabled and on or off according to their corresponding memory location.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_SEG_OFF</name>
                  <description>All LCD segments are off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_SEG_ON</name>
                  <description>All LCD segments are enabled and on or off according to their corresponding memory location.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDSYNCEXT</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_EXT_SYNC_OFF</name>
                  <description>External eynchronization off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_EXT_SYNC_ON</name>
                  <description>External synchronization on.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_LCDBLKCTL</name>
          <description>LCD blicking control register</description>
          <addressOffset>0x1108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDBLKMODx</name>
              <description>Blinking mode 00b = Blinking disabled.  01b = Blinking of individual segments as enabled in blinking memory register LCDBMx. In mux mode &gt;5 blinking is disabled.  10b = Blinking of all segments 11b = Switching between display contents as stored in LCDMx and LCDBMx memory registers. In mux mode &gt;5 blinking is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLINK_DISABLE</name>
                  <description>Blinking disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLINK_SELECED</name>
                  <description>Blinking of individual segments as enabled in blinking memory register LCDBMx. In mux mode &gt;5 blinking is disabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLINK_ALL</name>
                  <description>Blinking of all segments</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BKINK_TOGGLE</name>
                  <description>Switching between display contents as stored in LCDMx and LCDBMx memory registers. In mux mode &gt;5 blinking is disabled.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDBLKPREx</name>
              <description>Clock prescaler for blinking frequency.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>Divide by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>Divide by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>Divide by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_16</name>
                  <description>Divide by 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_32</name>
                  <description>Divide by 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_64</name>
                  <description>Divide by 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_128</name>
                  <description>Divide by 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_256</name>
                  <description>Divide by 256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCD_LCDMEMCTL</name>
          <description>LCD memory control LCD memory control register</description>
          <addressOffset>0x110C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDCLRBM</name>
              <description>Clear LCD blinking memory Clears all blinking memory registers LCDBMx. The bit is automatically reset when the blinking memory is cleared.  Setting this bit in 5-mux mode and above has no effect. It is immediately reset again.  0b = Contents of blinking memory registers LCDBMx remain unchanged 1b = Clear content of all blinking memory registers LCDBMx</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLR_BLNK_MEM_REGS</name>
                  <description>Contents of blinking memory registers LCDBMx remain unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_BLNK_MEM_REGS</name>
                  <description>Clear content of all blinking memory registers LCDBMx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDCLRM</name>
              <description>Clear LCD memory Clears all LCD memory registers LCDMx. The bit is automatically reset when the LCD memory is cleared.  0b = Contents of LCD memory registers LCDMx remain unchanged 1b = Clear content of all LCD memory registers LCDMx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLR_LCD_MEM_REGS</name>
                  <description>Contents of LCD memory registers LCDMx remain unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_LCD_MEM_REGS</name>
                  <description>Clear content of all LCD memory registers LCDMx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDDISP</name>
              <description>Select LCD memory registers for display When LCDBLKMODx = 00, LCDDISP can be set by software.  The bit is cleared in LCDBLKMODx = 01 and LCDBLKMODx = 10 or if a mux mode =5 is selected and cannot be changed by software.  When LCDBLKMODx = 11, this bit reflects the currently displayed memory but cannot be changed by software. When returning to LCDBLKMODx = 00 the bit is cleared.  0b = Display content of LCD memory registers LCDMx 1b = Display content of LCD blinking memory registers LCDBMx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL_LCD_MEM_REGS</name>
                  <description>Display content of LCD memory registers LCDMx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_BLNK_MEM_REGS</name>
                  <description>Display content of LCD blinking memory registers LCDBMx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
