exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
        <register>
          <name>LCD_LCDVCTL</name>
          <description>LCD voltage control register</description>
          <addressOffset>0x1110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDBIASSEL</name>
              <description>Bias select.  LCDBIASSEL is ignored in static mode as well as for 2-mux, 3-mux and 4-mux LCD modes.  For 5-mux to 8-mux modes: 0b = 1/3 bias 1b = 1/4 bias</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_BY_3_BIAS</name>
                  <description>1/3 bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_BY_4_BIAS</name>
                  <description>1/4 bias</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDCPEN</name>
              <description>Charge pump enable 0b = Charge pump disabled(1) 1b = Charge pump enabled when VLCD is generated internally (VLCDEXT = 0) and VLCDx &gt; 0 or VLCDREFx &gt; 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP_DISABLE</name>
                  <description>Charge pump disabled(1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_ENABLE</name>
                  <description>Charge pump enabled when VLCD is generated internally (VLCDEXT = 0) and VLCDx &gt; 0 or VLCDREFx &gt; 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDCPFSELx</name>
              <description>Charge pump frequency selection.  0000b = 32.768 kHz / 1 / 8 = 4.096 kHz 0001b = 32.768 kHz / 2 / 8 = 2.048 kHz 0010b = 32.768 kHz / 3 / 8 = 1.365 kHz 0011b = 32.768 kHz / 4 / 8 = 1.024 kHz 0100b = 32.768 kHz / 5 / 8 = 819 Hz 0101b = 32.768 kHz / 6 / 8 = 682 Hz 0110b = 32.768 kHz / 7 / 8 = 585 Hz 0111b = 32.768 kHz / 8 / 8 = 512 Hz 1000b = 32.768 kHz / 9 / 8 = 455 Hz 1001b = 32.768 kHz / 10 / 8 = 409 Hz 1010b = 32.768 kHz / 11 / 8 = 372 Hz 1011b = 32.768 kHz / 12 / 8 = 341 Hz 1100b = 32.768 kHz / 13 / 8 = 315 Hz 1101b = 32.768 kHz / 14 / 8 = 292 Hz 1110b = 32.768 kHz / 15 / 8 = 273 Hz 1111b = 32.768 kHz / 16 / 8 = 256 Hz</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_BY_1_BY_8</name>
                  <description>32.768 kHz / 1 / 8 = 4.096 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2_BY_8</name>
                  <description>32.768 kHz / 2 / 8 = 2.048 kHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_3_BY_8</name>
                  <description>32.768 kHz / 3 / 8 = 1.365 kHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4_BY_8</name>
                  <description>32.768 kHz / 4 / 8 = 1.024 kHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_5_BY_8</name>
                  <description>32.768 kHz / 5 / 8 = 819 Hz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_6_BY_8</name>
                  <description>32.768 kHz / 6 / 8 = 682 Hz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_7_BY_8</name>
                  <description>32.768 kHz / 7 / 8 = 585 Hz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8_BY_8</name>
                  <description>32.768 kHz / 8 / 8 = 512 Hz</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_9_BY_8</name>
                  <description>32.768 kHz / 9 / 8 = 455 Hz</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_10_BY_8</name>
                  <description>32.768 kHz / 10 / 8 = 409 Hz</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_11_BY_8</name>
                  <description>32.768 kHz / 11 / 8 = 372 Hz</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_12_BY_8</name>
                  <description>32.768 kHz / 12 / 8 = 341 Hz</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_13_BY_8</name>
                  <description>32.768 kHz / 13 / 8 = 315 Hz</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_14_BY_8</name>
                  <description>32.768 kHz / 14 / 8 = 292 Hz</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_15_BY_8</name>
                  <description>32.768 kHz / 15 / 8 = 273 Hz</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_16_BY_8</name>
                  <description>32.768 kHz / 16 / 8 = 256 Hz</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDINTBIASEN</name>
              <description>Enables the internal bias voltage resistor divider.  The actual voltage source used for the resistor divider is selected by the VLCDSEL_VDD_R33 bit configuration.  0b = Internal bias voltage resistor divider is disabled 1b = Internal bias voltage resistor divider is enabledDD</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_BIAS_DISABLE</name>
                  <description>Internal bias voltage resistor divider is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_BIAS_ENABLE</name>
                  <description>Internal bias voltage resistor divider is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDREFEN</name>
              <description>Internal reference voltage enable on R13 0b = Internal reference voltage disabled 1b = Internal reference voltage enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_REF_DISABLE</name>
                  <description>Internal reference voltage disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_REF_ENABLE</name>
                  <description>Internal reference voltage enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDREFMODE</name>
              <description>Selects whether R13 voltage is switched or in static mode 0b = Static mode 1b = Switched mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATIC_MODE</name>
                  <description>Static mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWITCHED_MODE</name>
                  <description>Switched mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDSELVDD</name>
              <description>Selects if R33 is supplied either from AVDD internally or from charge pump 0b = R33 connected to external supply 1b = R33 internally connected to AVDD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL_EXT_SUPPLY</name>
                  <description>R33 connected to external supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_AVDD</name>
                  <description>R33 internally connected to AVDD</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCD_HP_LP</name>
              <description>High-power or Low-power LCD.  This bit is only effective when the internal bias voltage resistor divider is used, that is, when LCDINTBIASEN = 1. It selects the resistor ladder that is used to generate the bias voltages for the LCD.  0b = Low-power LCD is used 1b = Higher-power LCD is used</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_MODE</name>
                  <description>Low-power LCD is used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_MODE</name>
                  <description>Higher-power LCD is used</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLCDSEL_VDD_R33</name>
              <description>Selects if the LCD bias voltage V1 is sourced from the R33 pin or from the internal supply voltage AVDD This bit is only effective when the internal bias voltage resistor divider is used, that is, when LCDINTBIASEN = 1 0b = V1 is sourced from R33 1b = V1 is sourced internally from AVDD</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL_R33</name>
                  <description>V1 is sourced from R33</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_AVDD</name>
                  <description>V1 is sourced internally from AVDD</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLCDx</name>
              <description>Internal reference voltage select on R13.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL_2P60V</name>
                  <description>2.60 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_2P66V</name>
                  <description>2.66 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_2P72V</name>
                  <description>2.72 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_2P78V</name>
                  <description>2.78 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_2P84V</name>
                  <description>2.84 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_2P90V</name>
                  <description>2.90 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_2P96V</name>
                  <description>2.96 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P02V</name>
                  <description>3.02 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P08V</name>
                  <description>3.08 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P14V</name>
                  <description>3.14 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P20V</name>
                  <description>3.20 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P26V</name>
                  <description>3.26 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P32V</name>
                  <description>3.32 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P38V</name>
                  <description>3.38 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P44V</name>
                  <description>3.44 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL_3P50V</name>
                  <description>3.50 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDVBSTEN</name>
              <description>Enables the voltage boost circuitry which provides a boosted VDDA voltage. This boosted voltage is to be used in the switch controls, when the VDDA supply is less than 1.6V.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
