exploiitm/mspm0l2228-hal/pac/svd/MSPM0L222X.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WUC</name>
      <version>1.0</version>
      <description>PERIPHERALREGION</description>
      <groupName>WUC</groupName>
      <baseAddress>0x40424000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x500</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WUC_FSUB_0</name>
          <description>Subscriber Port 0</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WUC_FSUB_1</name>
          <description>Subscriber Port 1</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANID</name>
              <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONNECTED</name>
                  <description>A value of 0 specifies that the event is not connected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>